[
  {
    "name": "BKT Cribs - Apartments & Suites",
    "location": "Abuja",
    "ratings": 8.7,
    "starRating": 4,
    "reviews": "247 reviews",
    "descriptions": "Located in Abuja, 3.3 miles from Magic Land Abuja, BKT Cribs - Apartments & Suites has accommodations with an outdoor swimming pool, free private parking, a fitness center and a bar. "
  },
  {
    "name": "Aveon Hotel",
    "location": "Abuja",
    "ratings": 7.7,
    "starRating": 5,
    "reviews": "133 reviews",
    "descriptions": "Located in Abuja, 7.3 miles from IBB Golf Club, Aveon Hotel provides accommodations with an outdoor swimming pool, free private parking, a fitness center and a shared lounge. "
  },
  {
    "name": "Wali's Suites",
    "location": "Abuja",
    "ratings": 8.1,
    "starRating": 4,
    "reviews": "165 reviews",
    "descriptions": "Located in Abuja, 4.4 miles from Magic Land Abuja, Wali's Suites has accommodations with an outdoor swimming pool, free private parking, a fitness center and a garden. "
  },
  {
    "name": "Kam Apartment and Taverns",
    "location": "Abuja",
    "ratings": 7.3,
    "starRating": null,
    "reviews": "65 reviews",
    "descriptions": "A recently renovated apartment in Abuja, Kam Apartment and Taverns offers outdoor fireplace, parking on-site, and sports facilities. "
  },
  {
    "name": "Musada Luxury Hotels and Suites",
    "location": "Abuja",
    "ratings": 8.2,
    "starRating": 4,
    "reviews": "288 reviews",
    "descriptions": "Located in Abuja, within 4.1 miles of IBB Golf Club and 5.3 miles of Magic Land Abuja, Musada Luxury Hotels and Suites has accommodations with a bar and free WiFi throughout the property as well as..."
  },
  {
    "name": "Ibiyemi Apartment",
    "location": "Abuja",
    "ratings": 7.1,
    "starRating": null,
    "reviews": "77 reviews",
    "descriptions": "A recently renovated apartment, Ibiyemi Apartment offers accommodations in Abuja. This property offers access to a terrace, tennis at the tennis court, free private parking, and free Wifi. "
  },
  {
    "name": "Nordic Hotel Abuja",
    "location": "Abuja",
    "ratings": 7.9,
    "starRating": 5,
    "reviews": "654 reviews",
    "descriptions": "Featuring free WiFi, a restaurant and a year-round outdoor pool, Nordic Hotel Abuja offers accommodations in Jabi. "
  },
  {
    "name": "Tree House Boutique Hotel",
    "location": "Abuja",
    "ratings": 9.5,
    "starRating": null,
    "reviews": "17 reviews",
    "descriptions": "Located in Abuja, 5.8 miles from Magic Land Abuja, Tree House Boutique Hotel has accommodations with a garden, free private parking, a terrace and a restaurant. "
  },
  {
    "name": "Residency Hotel Area11 Garki Abuja",
    "location": "Abuja",
    "ratings": 7,
    "starRating": null,
    "reviews": "51 reviews",
    "descriptions": "Located in Abuja, 4.4 miles from IBB Golf Club, Residency Hotel Area11 Garki Abuja has accommodations with an outdoor swimming pool, free private parking, a fitness center and a restaurant. "
  },
  {
    "name": "ROSES REGENCY HOTEL AND SUITES",
    "location": "Abuja",
    "ratings": 6.6,
    "starRating": 3,
    "reviews": "24 reviews",
    "descriptions": "Located 2.7 miles from Magic Land Abuja, ROSES REGENCY HOTEL AND SUITES offers 3-star accommodations in Abuja and features a garden, a terrace and a bar. "
  },
  {
    "name": "The Leneade",
    "location": "Abuja",
    "ratings": 9.2,
    "starRating": null,
    "reviews": "45 reviews",
    "descriptions": "The Leneade is offering accommodations in Abuja. This recently renovated apartment is located 3.8 miles from IBB Golf Club and 4.4 miles from Magic Land Abuja. "
  },
  {
    "name": "Nordic Villa",
    "location": "Abuja",
    "ratings": 8.1,
    "starRating": 3,
    "reviews": "311 reviews",
    "descriptions": "Nordic Villa offers Scandinavian design accommodations in Jabi. Guests can enjoy the on-site bar. Free WiFi is provided throughout the property and free private parking is available on site. "
  },
  {
    "name": "Apartment550",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Apartment550 in Abuja provides accommodations with a casino, a garden, and a bar. This property offers access to a terrace and free private parking. "
  },
  {
    "name": "The Wells Carlton",
    "location": "Abuja",
    "ratings": 7.3,
    "starRating": 5,
    "reviews": "93 reviews",
    "descriptions": "Located in Abuja, 4.6 miles from IBB Golf Club, The Wells Carlton provides accommodations with an outdoor swimming pool, free private parking, a fitness center and a shared lounge. "
  },
  {
    "name": "Bee-City Homes",
    "location": "Abuja",
    "ratings": 8.9,
    "starRating": null,
    "reviews": "19 reviews",
    "descriptions": "Bee-City Homes is located in Abuja, just 4 miles from Magic Land Abuja and 5.4 miles from IBB Golf Club. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "Yessit Homestay",
    "location": "Abuja",
    "ratings": 7.3,
    "starRating": null,
    "reviews": "4 reviews",
    "descriptions": "Offering quiet street views, Yessit Homestay in Abuja provides accommodations and a garden. This apartment offers free private parking, full-day security, and free Wifi. "
  },
  {
    "name": "Austra Villa Maitama Abuja",
    "location": "Abuja",
    "ratings": 7.3,
    "starRating": 3,
    "reviews": "3 reviews",
    "descriptions": "Located in Abuja, 5.4 miles from IBB Golf Club, Austra Villa Maitama Abuja has accommodations with a garden, free private parking, a terrace and a restaurant. "
  },
  {
    "name": "Sinclair Guest House",
    "location": "Abuja",
    "ratings": 7.9,
    "starRating": 4,
    "reviews": "383 reviews",
    "descriptions": "Located in Abuja, 4.5 miles from IBB Golf Club, Sinclair Guest House has accommodations with a shared lounge, free private parking, a terrace and a restaurant. "
  },
  {
    "name": "BON Hotel Abuja",
    "location": "Abuja",
    "ratings": 8,
    "starRating": null,
    "reviews": "111 reviews",
    "descriptions": "Located in Abuja, 5.2 miles from Magic Land Abuja, BON Hotel Abuja has accommodations with an outdoor swimming pool, free private parking, a fitness center and a garden. "
  },
  {
    "name": "Executive Royal Suites Kado",
    "location": "Abuja",
    "ratings": 7.2,
    "starRating": null,
    "reviews": "19 reviews",
    "descriptions": "Executive Royal Suites Kado is a recently renovated condo hotel in Abuja where guests can make the most of its fitness center and open-air bath. "
  },
  {
    "name": "E-Gold Luxury Hotel, Maitama",
    "location": "Abuja",
    "ratings": 6.1,
    "starRating": null,
    "reviews": "38 reviews",
    "descriptions": "Located in Abuja, 4 miles from IBB Golf Club, E-Gold Luxury Hotel, Maitama provides accommodations with a seasonal outdoor swimming pool, free private parking, a terrace and a restaurant. "
  },
  {
    "name": "Hybrid Apartemnts and Suites",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Hybrid Apartemnts and Suites offers accommodations in Abuja, 6.6 miles from Magic Land Abuja and 6.9 miles from IBB Golf Club. "
  },
  {
    "name": "SV Chrome",
    "location": "Abuja",
    "ratings": 7.8,
    "starRating": 4,
    "reviews": "177 reviews",
    "descriptions": "Located in Abuja, 4.9 miles from Magic Land Abuja, SV Chrome provides accommodations with a fitness center, free private parking, a garden and a shared lounge. "
  },
  {
    "name": "The Envoy Hotel Abuja",
    "location": "Abuja",
    "ratings": 8.4,
    "starRating": 5,
    "reviews": "90 reviews",
    "descriptions": "Located in Abuja, 2.8 miles from Magic Land Abuja, The Envoy Hotel Abuja provides accommodations with an outdoor swimming pool, free private parking, a fitness center and a garden. "
  },
  {
    "name": "Kashco Apartments Wuse 2 Abuja",
    "location": "Abuja",
    "ratings": 8.9,
    "starRating": null,
    "reviews": "18 reviews",
    "descriptions": "Kashco Apartments Wuse 2 Abuja is a recently renovated guest house in Abuja where guests can make the most of its garden and bar. "
  },
  {
    "name": "Whytescape Serviced Apartments",
    "location": "Abuja",
    "ratings": 7.1,
    "starRating": null,
    "reviews": "196 reviews",
    "descriptions": "7 miles from Magic Land Abuja in Abuja, Whytescape Serviced Apartments features accommodations with access to a fitness room. "
  },
  {
    "name": "D & D Apartments",
    "location": "Abuja",
    "ratings": 8,
    "starRating": 3,
    "reviews": "22 reviews",
    "descriptions": "Located in Abuja, 4.5 miles from IBB Golf Club, D & D Apartments has accommodations with a garden, free private parking and a terrace. "
  },
  {
    "name": "Oslo Apartment",
    "location": "Abuja",
    "ratings": 9.5,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "Oslo Apartment offers accommodations in Abuja, 8.3 miles from Magic Land Abuja and 14 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Koraf Hotels",
    "location": "Abuja",
    "ratings": 7.2,
    "starRating": null,
    "reviews": "298 reviews",
    "descriptions": "Located in Abuja, 12 miles from IBB Golf Club, Koraf Hotels has accommodations with an outdoor swimming pool, free private parking, a garden and a shared lounge. "
  },
  {
    "name": "Anabel Apartment and Suites, Abuja",
    "location": "Abuja",
    "ratings": 7.2,
    "starRating": null,
    "reviews": "31 reviews",
    "descriptions": "5.2 miles from IBB Golf Club in Abuja, Anabel Apartment and Suites, Abuja features accommodations with access to a fitness center. A hot tub and a car rental service are available for guests. "
  },
  {
    "name": "Cedarwood Apartments",
    "location": "Abuja",
    "ratings": 8.8,
    "starRating": null,
    "reviews": "14 reviews",
    "descriptions": "Offering garden views, Cedarwood Apartments in Abuja provides accommodations and a garden. "
  },
  {
    "name": "Transcorp Hilton Abuja",
    "location": "Abuja",
    "ratings": 8.2,
    "starRating": 5,
    "reviews": "683 reviews",
    "descriptions": "Sustainability certification"
  },
  {
    "name": "Tranquil Mews Hotel",
    "location": "Abuja",
    "ratings": 7.5,
    "starRating": 3,
    "reviews": "822 reviews",
    "descriptions": " Offering a restaurant, Tranquil Mews is located in Abuja. Free WiFi access is available. Each room here will provide you with a TV, air conditioning and a terrace. "
  },
  {
    "name": "Private, Cozy, CityCentre Studios",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Providing garden views, Private, Cozy, CityCentre Studios in Abuja features accommodations, a garden, and a bar. There's a private entrance at the apartment for the convenience of those who stay. "
  },
  {
    "name": "Exotic 2 BR Apartment at Wuye, Abuja - Wifi,Netflix",
    "location": "Abuja",
    "ratings": 7.6,
    "starRating": null,
    "reviews": "17 reviews",
    "descriptions": "Offering a garden, Exotic 2 BR Apartment at Wuye, Abuja - Wifi, Netflix offers accommodations in Abuja. This property offers access to a balcony and free private parking. Guests can use a terrace. "
  },
  {
    "name": "MayFair Hotel Maitama Abuja",
    "location": "Abuja",
    "ratings": 6.9,
    "starRating": 4,
    "reviews": "211 reviews",
    "descriptions": "Located in Abuja, 3.7 miles from IBB Golf Club, MayFair Hotel Maitama Abuja has accommodations with a fitness center, free private parking, a garden and a terrace. "
  },
  {
    "name": "Fahrenheit Apartments",
    "location": "Abuja",
    "ratings": 8.3,
    "starRating": null,
    "reviews": "18 reviews",
    "descriptions": "Located in Abuja, 2.9 miles from IBB Golf Club, Fahrenheit Apartments features views of the garden. There is free private parking and the property has paid airport shuttle service. "
  },
  {
    "name": "Wine House, Maitama, Abuja",
    "location": "Abuja",
    "ratings": 8.7,
    "starRating": null,
    "reviews": "41 reviews",
    "descriptions": "Wine House, Maitama, Abuja enjoys a location in Abuja, 4.8 miles from IBB Golf Club and 6.8 miles from Magic Land Abuja. "
  },
  {
    "name": "Qlets Privé",
    "location": "Abuja",
    "ratings": 9.4,
    "starRating": null,
    "reviews": "8 reviews",
    "descriptions": "Qlets Privé features air-conditioned rooms in Abuja. Private parking is available on site at this recently renovated property. "
  },
  {
    "name": "THE HAPPY PLACE - Luxurious Apartment with Cozy Rooms, Stunning Views, Smart TVs, and Jet-Fast Internet",
    "location": "Abuja",
    "ratings": 8.7,
    "starRating": null,
    "reviews": "6 reviews",
    "descriptions": "THE HAPPY PLACE - Luxurious Apartment with Cozy Rooms, Stunning Views, Smart TVs, and Jet-Fast Internet enjoys a location in Abuja, 3.1 miles from Magic Land Abuja and 8.1 miles from IBB Golf Club. "
  },
  {
    "name": "Abuja Skyline Suites",
    "location": "Abuja",
    "ratings": 5.5,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "Abuja Skyline Suites enjoys a location in Abuja, 6.1 miles from Magic Land Abuja and 9 miles from IBB Golf Club. Both Wifi and private parking are available at the apartment free of charge. "
  },
  {
    "name": "OD-V!CK'S LUXE, WUSE DISTRICT, Swimming Pool, Gym, WiFi, 24hr power, security, Dstv",
    "location": "Abuja",
    "ratings": 7,
    "starRating": null,
    "reviews": "6 reviews",
    "descriptions": "A good location for a hassle-free stay in Abuja, OD-V!CK'S LUXE, WUSE DISTRICT, Swimming Pool, Gym, WiFi, 24hr power, security, Dstv is a guest house surrounded by views of the quiet street. "
  },
  {
    "name": "Luxury Oasis 3 - Entire 3 Bedroom Apartment in Abuja with Pool, Games, WiFi, Balcony, and Garden",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Luxury Oasis 3 - Entire 3 Bedroom Apartment in Abuja with Pool, Games, WiFi, Balcony, and Garden is located in Abuja, just 4.5 miles from Magic Land Abuja and 7.2 miles from IBB Golf Club. "
  },
  {
    "name": "Morak homes - Smart luxury 4-bed with private swimming pool, PS5, snooker, mini gym in reserved secured estate",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "4 reviews",
    "descriptions": "8.3 miles from IBB Golf Club in Abuja, Morak homes - Smart luxury 4-bed with private swimming pool, PS5, snooker, mini gym in reserved secured estate offers accommodations with access to a fitness..."
  },
  {
    "name": "Maximo short stay Maitama",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Maximo short stay Maitama offers accommodations in Abuja, 7.7 miles from Magic Land Abuja. "
  },
  {
    "name": "Sinclair Lake Chad",
    "location": "Abuja",
    "ratings": 8.2,
    "starRating": null,
    "reviews": "203 reviews",
    "descriptions": "Sinclair Lake Chad enjoys a location in Abuja, 4.7 miles from IBB Golf Club and 7.2 miles from Magic Land Abuja. "
  },
  {
    "name": "Hotel Rosebud",
    "location": "Abuja",
    "ratings": 7.2,
    "starRating": 3,
    "reviews": "32 reviews",
    "descriptions": "Featuring a bar, Hotel Rosebud offers accommodations in Abuja. This bed and breakfast features free private parking, a 24-hour front desk, and free Wifi. "
  },
  {
    "name": "Brickland Residence",
    "location": "Abuja",
    "ratings": 5.8,
    "starRating": 3,
    "reviews": "15 reviews",
    "descriptions": "Located in Abuja, 2.9 miles from Magic Land Abuja, Brickland Residence provides accommodations with a garden, free private parking, a restaurant and a bar. "
  },
  {
    "name": "Grand Pela Hotel & Suites",
    "location": "Abuja",
    "ratings": 7.8,
    "starRating": 4,
    "reviews": "56 reviews",
    "descriptions": "Featuring free WiFi, Grand Pela Hotel & Suites offers accommodations in Abuja. The hotel has a spa center and fitness center, and guests can enjoy a drink at the bar. "
  },
  {
    "name": "Royalton Hotels Abuja",
    "location": "Abuja",
    "ratings": 6.7,
    "starRating": 3,
    "reviews": "76 reviews",
    "descriptions": "Royalton Hotels Abuja features a fitness center, shared lounge, a restaurant and bar in Abuja. With free WiFi, this 3-star hotel offers room service and a 24-hour front desk. "
  },
  {
    "name": "Tony Kams",
    "location": "Abuja",
    "ratings": 7,
    "starRating": null,
    "reviews": "3 reviews",
    "descriptions": "Offering a garden, Tony Kams features accommodations in Abuja. This property offers access to a terrace and free private parking. The property offers a 24-hour front desk. "
  },
  {
    "name": "Qualibest Grand Hotels",
    "location": "Abuja",
    "ratings": 6.6,
    "starRating": 4,
    "reviews": "14 reviews",
    "descriptions": "Qualibest Grand Hotels has an outdoor swimming pool, fitness center, a garden and shared lounge in Abuja. "
  },
  {
    "name": "Estrella Boutique Hotel",
    "location": "Abuja",
    "ratings": null,
    "starRating": 4,
    "reviews": null,
    "descriptions": "Located in Abuja, 3.8 miles from Magic Land Abuja, Estrella Boutique Hotel has accommodations with an outdoor swimming pool, free private parking, a restaurant and a bar. "
  },
  {
    "name": "Abuja Continental Hotel",
    "location": "Abuja",
    "ratings": 6.9,
    "starRating": 5,
    "reviews": "335 reviews",
    "descriptions": " Offering an outdoor pool and a restaurant, Abuja Continental Hotel is located in Abuja. Each room here will provide you with air conditioning. Private bathroom also comes with a bath or shower. "
  },
  {
    "name": "BON Hotel Asokoro Residence",
    "location": "Abuja",
    "ratings": 7.1,
    "starRating": 4,
    "reviews": "23 reviews",
    "descriptions": "Located in Abuja, 7.5 miles from IBB Golf Club, BON Hotel Asokoro Residence provides accommodations with an outdoor swimming pool, free private parking, a fitness center and a restaurant. "
  },
  {
    "name": "99 MOZILLA APARTMENTS AND SUITES",
    "location": "Abuja",
    "ratings": 8.8,
    "starRating": null,
    "reviews": "6 reviews",
    "descriptions": "99 MOZILLA APARTMENTS AND SUITES offers a fitness room and air-conditioned accommodations with free Wifi in Abuja, 9 miles from Magic Land Abuja. This apartment features a terrace. "
  },
  {
    "name": "UrbaN RootZ",
    "location": "Abuja",
    "ratings": 9.1,
    "starRating": 5,
    "reviews": "19 reviews",
    "descriptions": "Located in Abuja, within 4.6 miles of IBB Golf Club and 6.8 miles of Magic Land Abuja, UrbaN RootZ provides accommodations with a shared lounge and free WiFi throughout the property as well as free..."
  },
  {
    "name": "Tranquila Hotels and Suites Abuja",
    "location": "Abuja",
    "ratings": 7.9,
    "starRating": 4,
    "reviews": "13 reviews",
    "descriptions": "Located in Abuja, 4 miles from Magic Land Abuja, Tranquila Hotels and Suites Abuja provides accommodations with an outdoor swimming pool, free private parking, a restaurant and a bar. "
  },
  {
    "name": "Citilodge Hotel & Conference Centre",
    "location": "Abuja",
    "ratings": 6.8,
    "starRating": null,
    "reviews": "67 reviews",
    "descriptions": "Located in Abuja, 3.2 miles from Magic Land Abuja, Citilodge Hotel & Conference Centre provides accommodations with a shared lounge, free private parking, a restaurant and a bar. "
  },
  {
    "name": "Abuja Apartments 24",
    "location": "Abuja",
    "ratings": 3.8,
    "starRating": null,
    "reviews": "11 reviews",
    "descriptions": "Providing a garden, Abuja Apartments 24 features accommodations in Abuja. The air-conditioned accommodation is 6.9 miles from Magic Land Abuja. "
  },
  {
    "name": "Candellux Imperial Hotel and Suites Abuja",
    "location": "Abuja",
    "ratings": null,
    "starRating": 3,
    "reviews": null,
    "descriptions": "Located in Abuja, 3.2 miles from Magic Land Abuja, Candellux Imperial Hotel and Suites Abuja has accommodations with a terrace, free private parking, a restaurant and a bar. "
  },
  {
    "name": "Nisa Wellness Retreat",
    "location": "Abuja",
    "ratings": 7.4,
    "starRating": null,
    "reviews": "25 reviews",
    "descriptions": "Located in Abuja, 4.5 miles from IBB Golf Club, Nisa Wellness Retreat provides accommodations with an outdoor swimming pool, free private parking, a garden and a shared lounge. "
  },
  {
    "name": "24Hrs LIGHT & FREE WIFI, put FURNISHED APARTMENTS on Google & TALK TO US -BQ 20K, 1BEDROOM FLAT & STUDIO 25k, 40k, 45k, 50k, 60k 2BEDROOM FLATS 45k, 90k,100k, 3BEDROOM FLAT 60k,100k,150k Per nit",
    "location": "Abuja",
    "ratings": 8.7,
    "starRating": null,
    "reviews": "3 reviews",
    "descriptions": "24Hrs LIGHT & FREE WIFI, put FURNISHED APARTMENTS on Google & TALK TO US -BQ 20K, 1BEDROOM FLAT & STUDIO 25k, 40k, 45k, 50k, 60k 2BEDROOM FLATS 45k, 90k,100k, 3BEDROOM FLAT 60k,100k,150k Per nit..."
  },
  {
    "name": "Golphins hotel Abuja",
    "location": "Abuja",
    "ratings": 6.3,
    "starRating": 5,
    "reviews": "3 reviews",
    "descriptions": "Located in Abuja, 3.9 miles from Magic Land Abuja, Golphins hotel Abuja provides accommodations with a restaurant, free private parking and a bar. "
  },
  {
    "name": "City Centre Luxe 2 Bedroom with Netflix Wifi Pool 247 Electricity",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "A recently renovated apartment, City Centre Luxe 2 Bedroom with Netflix Wifi Pool 247 Electricity offers accommodations in Abuja. "
  },
  {
    "name": "MO-House Hotels and Apartments Mabushi",
    "location": "Abuja",
    "ratings": 9,
    "starRating": 3,
    "reviews": "1 review",
    "descriptions": "Located in Abuja, 3.4 miles from Magic Land Abuja, MO-House Hotels and Apartments Mabushi has accommodations with a garden, free private parking, a restaurant and a bar. "
  },
  {
    "name": "Cozy & Productive Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Cozy & Productive Apartment is located in Abuja, just 7.1 miles from Magic Land Abuja and 11 miles from IBB Golf Club. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "Plush Hotel,Abuja",
    "location": "Abuja",
    "ratings": 8,
    "starRating": 3,
    "reviews": "77 reviews",
    "descriptions": "Located in Abuja, 3.7 miles from Magic Land Abuja, Plush Hotel, Abuja has accommodations with a restaurant, free private parking and a bar. "
  },
  {
    "name": "Lit Suites",
    "location": "Abuja",
    "ratings": 5.5,
    "starRating": null,
    "reviews": "4 reviews",
    "descriptions": "Located in Abuja, 4.5 miles from Magic Land Abuja, Lit Suites provides accommodations with an outdoor swimming pool, free private parking, a restaurant and a bar. "
  },
  {
    "name": "OandL APARTMENTS",
    "location": "Abuja",
    "ratings": null,
    "starRating": 4,
    "reviews": null,
    "descriptions": "Located 6.3 miles from Magic Land Abuja, OandL APARTMENTS offers 4-star accommodations in Abuja and has a bar. "
  },
  {
    "name": "BON Hotel Nest Garki II Abuja",
    "location": "Abuja",
    "ratings": 6.5,
    "starRating": 3,
    "reviews": "2 reviews",
    "descriptions": "Located in Abuja, 5 miles from Magic Land Abuja, BON Hotel Nest Garki II Abuja has accommodations with a fitness center, free private parking, a restaurant and a bar. "
  },
  {
    "name": "Andrea’s Home",
    "location": "Abuja",
    "ratings": 6,
    "starRating": null,
    "reviews": "10 reviews",
    "descriptions": "Andrea’s Home is offering accommodations in Abuja. 5.3 miles from Magic Land Abuja and 10 miles from IBB Golf Club, the property features a garden and a bar. "
  },
  {
    "name": "Executive Gold Hotel",
    "location": "Abuja",
    "ratings": 5,
    "starRating": 3,
    "reviews": "1 review",
    "descriptions": "Executive Gold Hotel is located in Abuja, 4 miles from IBB Golf Club and 8.8 miles from Magic Land Abuja. "
  },
  {
    "name": "Luxury 3 bed Apartmnt with Minimalist Aesthetic",
    "location": "Abuja",
    "ratings": 6.5,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "Luxury 3 bed Apartmnt with Minimalist Aesthetic offers accommodations in Abuja, 7.2 miles from Magic Land Abuja and 12 miles from IBB Golf Club. "
  },
  {
    "name": "Private, Cozy, CityCentre Studio I",
    "location": "Abuja",
    "ratings": 6.6,
    "starRating": null,
    "reviews": "14 reviews",
    "descriptions": "Private, Cozy, CityCentre Studio I offers accommodations in Abuja, 4.2 miles from Magic Land Abuja and 6.8 miles from IBB Golf Club. This apartment provides free private parking and full-day security...."
  },
  {
    "name": "Orchid",
    "location": "Abuja",
    "ratings": 6,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "Orchid offers accommodations in Abuja, 3.9 miles from Magic Land Abuja and 7 miles from IBB Golf Club. This apartment features free private parking, room service, and free Wifi. "
  },
  {
    "name": "C. Apartments Annex",
    "location": "Abuja",
    "ratings": 7.5,
    "starRating": null,
    "reviews": "13 reviews",
    "descriptions": "Located within 3.4 miles of Magic Land Abuja and 5.1 miles of IBB Golf Club, C. Apartments Annex has rooms in Abuja. The property provides room service and a 24-hour front desk for guests. "
  },
  {
    "name": "MEETHAQ HOTELS MAITAMA",
    "location": "Abuja",
    "ratings": null,
    "starRating": 3,
    "reviews": null,
    "descriptions": "Located in Abuja, within 3.5 miles of IBB Golf Club and 7.5 miles of Magic Land Abuja, MEETHAQ HOTELS MAITAMA provides accommodations with a restaurant and free WiFi throughout the property as well as..."
  },
  {
    "name": "Elytron Suites",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "With free private parking, the property is 4.3 miles from Magic Land Abuja and 5.1 miles from IBB Golf Club. The accommodation is non-smoking. "
  },
  {
    "name": "Luxury 1 bedroom apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Luxury 1 bedroom apartment offers accommodations in Abuja, 10 miles from IBB Golf Club. The air-conditioned accommodation is 4.4 miles from Magic Land Abuja. "
  },
  {
    "name": "Cute Studio@Wuse 2 Abuja",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "With free private parking, the property is 5 miles from Magic Land Abuja and 6.9 miles from IBB Golf Club. "
  },
  {
    "name": "NIFEWAT APARTMENT leed studio apartment with gym, Netflix and WiFi",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "3 reviews",
    "descriptions": "NIFEWAT APARTMENT leed studio apartment with gym, Netflix and WiFi is located in Abuja, just 2.9 miles from Magic Land Abuja and 4.4 miles from IBB Golf Club. "
  },
  {
    "name": "States Apartment",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "States Apartment offers accommodations in Abuja, 16 miles from IBB Golf Club and 18 miles from Magic Land Abuja. This property offers access to a terrace, free private parking, and free Wifi. "
  },
  {
    "name": "BDA APARTMENT - Netflix, Free Wi-Fi, PlayStation 4, Kitchen, Supermarket, Pharmacy, Laundry & 24hours Electricity",
    "location": "Abuja",
    "ratings": 7.3,
    "starRating": null,
    "reviews": "20 reviews",
    "descriptions": "Offering a garden, BDA APARTMENT - Netflix, Free Wi-Fi, PlayStation 4, Kitchen, Supermarket, Pharmacy, Laundry & 24hours Electricity features accommodations in Abuja. "
  },
  {
    "name": "The Noble Nook",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "The Noble Nook offers accommodations in Abuja, 6.5 miles from Magic Land Abuja and 10 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Jabezz homes",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Jabezz homes is located in Abuja, just 7.5 miles from Magic Land Abuja and 11 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "J's Place",
    "location": "Abuja",
    "ratings": 8.2,
    "starRating": 3,
    "reviews": "47 reviews",
    "descriptions": "Located in Abuja, 10 miles from IBB Golf Club, J's Place has accommodations with a fitness center, free private parking and a bar. "
  },
  {
    "name": "Hawthorn Suites by Wyndham Abuja",
    "location": "Abuja",
    "ratings": 7.2,
    "starRating": 4,
    "reviews": "96 reviews",
    "descriptions": "Offering an outdoor pool, Hawthorn Suites by Wyndham is located in Abuja. The property is 15 minutes by car from Abuja Stadium and Aso Rock and a 10-minute drive from Millennium Park. "
  },
  {
    "name": "1-bedroom apartment at Asokoro by ECOWAS",
    "location": "Abuja",
    "ratings": 7.7,
    "starRating": null,
    "reviews": "6 reviews",
    "descriptions": "1-bedroom apartment at Asokoro by ECOWAS is located in Abuja, just 4.4 miles from IBB Golf Club and 8.4 miles from Magic Land Abuja. The apartment provides both free Wifi and free private parking. "
  },
  {
    "name": "Private room with WIFI, Stable Power, City Center",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Private room with WIFI, Stable Power, City Center offers accommodations in Abuja, 10 miles from IBB Golf Club. "
  },
  {
    "name": "The Precious Pavilion",
    "location": "Abuja",
    "ratings": 8,
    "starRating": null,
    "reviews": "5 reviews",
    "descriptions": "A recently renovated apartment, The Precious Pavilion offers accommodations in Abuja. This property offers access to a terrace and free private parking. "
  },
  {
    "name": "Smart Homes",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Smart Homes offers accommodations in Abuja, 4.4 miles from Magic Land Abuja and 10 miles from IBB Golf Club. "
  },
  {
    "name": "De Silver Green Luxury Hotel",
    "location": "Abuja",
    "ratings": null,
    "starRating": 4,
    "reviews": null,
    "descriptions": "De Silver Green Luxury Hotel has an outdoor swimming pool, fitness center, a restaurant and bar in Abuja. This 4-star hotel offers room service and a 24-hour front desk. "
  },
  {
    "name": "NIFEWAT APARTMENT,Dijon studio apartment with pool,WiFi, gym,Netflix and sit out area",
    "location": "Abuja",
    "ratings": 8,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "7.4 miles from Magic Land Abuja in Abuja, NIFEWAT APARTMENT, Dijon studio apartment with pool, WiFi, gym, Netflix and sit out area provides accommodations with access to a fitness center. "
  },
  {
    "name": "Daisy",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Daisy is located in Abuja, just 3.9 miles from Magic Land Abuja and 7 miles from IBB Golf Club. This apartment features free private parking, full-day security, and free Wifi. "
  },
  {
    "name": "Pinewood Suite+ GYM+Snooker board. Rhodabode Nile",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "Pinewood Suite+ GYM+Snooker board. Rhodabode Nile offers accommodations in Abuja, 7 miles from Magic Land Abuja and 11 miles from IBB Golf Club. "
  },
  {
    "name": "BON Hotel Imperial",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Located in Abuja, 2.9 miles from Magic Land Abuja, BON Hotel Imperial has accommodations with a garden, free private parking, a shared lounge and a bar. "
  },
  {
    "name": "Neighborhood Guest House",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Providing a garden, Neighborhood Guest House provides accommodations in Abuja. With free private parking, the property is 13 miles from IBB Golf Club and 14 miles from Magic Land Abuja. "
  },
  {
    "name": "Bamculet Cafe and Standard Suites Limited",
    "location": "Abuja",
    "ratings": null,
    "starRating": 2,
    "reviews": null,
    "descriptions": "Located in Abuja, 12 miles from Magic Land Abuja, Bamculet Cafe and Standard Suites Limited provides accommodations with a restaurant, free private parking and a bar. "
  },
  {
    "name": "OD-V!CK'S CLASSIC, Wuse 2 extension, upscale Jahi district WiFi,24hr power,security, dstv",
    "location": "Abuja",
    "ratings": 6.5,
    "starRating": null,
    "reviews": "18 reviews",
    "descriptions": "OD-V!CK'S CLASSIC, Wuse 2 extension, upscale Jahi district WiFi,24hr power, security, dstv provides air-conditioned rooms in Abuja. "
  },
  {
    "name": "Rhodabode Apartments. A Luxury 3 bedroom bungalow.",
    "location": "Abuja",
    "ratings": 9.8,
    "starRating": null,
    "reviews": "5 reviews",
    "descriptions": "Rhodabode Apartments. A Luxury 3 bedroom bungalow. Offers accommodations in Abuja, 6.7 miles from Magic Land Abuja and 11 miles from IBB Golf Club. "
  },
  {
    "name": "Entire Serviced Two bedroom duplex Abuja - 24hr WIFI, POWER, OFFICE, FULL KITCHEN",
    "location": "Abuja",
    "ratings": 8.6,
    "starRating": null,
    "reviews": "9 reviews",
    "descriptions": "Providing a garden, Entire Serviced Two bedroom duplex Abuja - 24hr WIFI, POWER, OFFICE, FULL KITCHEN offers accommodations in Abuja. "
  },
  {
    "name": "Sommy's place 03",
    "location": "Abuja",
    "ratings": 7,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "Sommy's place 03 is located in Abuja, just 4.2 miles from Magic Land Abuja and 4.9 miles from IBB Golf Club. The apartment also offers free Wifi and free private parking. "
  },
  {
    "name": "Five Homes Hotel and Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Five Homes Hotel and Apartments provides an indoor pool and free private parking, and is within 5.9 miles of Magic Land Abuja and 8.8 miles of IBB Golf Club. "
  },
  {
    "name": "Maple studio+Gym+Snooker board Rhodabode Apt, Nile",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "3 reviews",
    "descriptions": "Maple studio+Gym+Snooker board Rhodabode Apt, Nile offers accommodations in Abuja, 7 miles from Magic Land Abuja and 11 miles from IBB Golf Club. "
  },
  {
    "name": "Cc & Cg Homes Luxury 4 Bedroom Semi-Detached House In Abuja, Nigeria",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "A recently renovated apartment in Abuja, Cc & Cg Homes Luxury 4 Bedroom Semi-Detached House In Abuja, Nigeria offers outdoor fireplace, private parking, and sports facilities. "
  },
  {
    "name": "Summerset Continental Hotel Maitama by T E L E Hospitality",
    "location": "Abuja",
    "ratings": null,
    "starRating": 3,
    "reviews": null,
    "descriptions": "Located in Abuja, 3.5 miles from IBB Golf Club, Summerset Continental Hotel Maitama by T E L E Hospitality features views of the city. "
  },
  {
    "name": "Aurora Smart Residence, Wuse 2, Abuja",
    "location": "Abuja",
    "ratings": 9,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "Aurora Smart Residence, Wuse 2, Abuja is a recently renovated apartment in Abuja where guests can make the most of its fitness center and garden. "
  },
  {
    "name": "Morak Homes - Luxury 4 bed home with PS5, 24hrs electricity, Super fast Wifi, Snooker, Games room - in a secured estate",
    "location": "Abuja",
    "ratings": 9.6,
    "starRating": null,
    "reviews": "18 reviews",
    "descriptions": "5.8 miles from Magic Land Abuja in Abuja, Morak Homes - Luxury 4 bed home with PS5, 24hrs electricity, Super fast Wifi, Snooker, Games room - in a secured estate provides accommodations with access to..."
  },
  {
    "name": "Knightsbridge Hotel & Suites",
    "location": "Abuja",
    "ratings": 8.4,
    "starRating": null,
    "reviews": "9 reviews",
    "descriptions": "Located in Abuja, within 4.2 miles of IBB Golf Club and 7.1 miles of Magic Land Abuja, Knightsbridge Hotel & Suites provides accommodations with a restaurant and free WiFi throughout the property as..."
  },
  {
    "name": "Vintz Apartments",
    "location": "Abuja",
    "ratings": 7.9,
    "starRating": null,
    "reviews": "21 reviews",
    "descriptions": "Vintz Apartments is located in Abuja, just 5.6 miles from Magic Land Abuja and 11 miles from IBB Golf Club. This property offers access to a patio and free private parking. "
  },
  {
    "name": "KH Lodge Abuja",
    "location": "Abuja",
    "ratings": 7.4,
    "starRating": null,
    "reviews": "129 reviews",
    "descriptions": "Providing free Wifi, private parking, and a garden, the recently renovated property KH Lodge Abuja offers rooms in Abuja, 11 miles from IBB Golf Club and 13 miles from Magic Land Abuja. "
  },
  {
    "name": "House X",
    "location": "Abuja",
    "ratings": 7.3,
    "starRating": null,
    "reviews": "149 reviews",
    "descriptions": "Offering inner courtyard views, House X in Abuja features accommodations, a bar, and a shared lounge. There's a private entrance at the guest house for the convenience of those who stay. "
  },
  {
    "name": "lnfinity Luxury Apartment",
    "location": "Abuja",
    "ratings": 8,
    "starRating": 4,
    "reviews": "2 reviews",
    "descriptions": "Located within 26 miles of IBB Golf Club and 27 miles of Magic Land Abuja, lnfinity Luxury Apartment provides rooms in Abuja. This 4-star hotel offers room service, a 24-hour front desk and free WiFi...."
  },
  {
    "name": "Xperience",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Xperience offers accommodations in Abuja, 6.6 miles from Magic Land Abuja and 11 miles from IBB Golf Club. This apartment provides air-conditioned accommodations with a balcony. "
  },
  {
    "name": "cosmopolitan comfort",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Cosmopolitan comfort offers accommodations in Abuja, 3.1 miles from Magic Land Abuja and 6 miles from IBB Golf Club. This property offers access to a terrace and free private parking. "
  },
  {
    "name": "Bricks Point - Boutique Apartments",
    "location": "Abuja",
    "ratings": 8.5,
    "starRating": 5,
    "reviews": "4 reviews",
    "descriptions": "Bricks Point - Boutique Apartments is a recently renovated apartment in Abuja where guests can make the most of its fitness center and terrace. "
  },
  {
    "name": "J's Place Hotel",
    "location": "Abuja",
    "ratings": null,
    "starRating": 3,
    "reviews": null,
    "descriptions": "Located in Abuja, 6.5 miles from Magic Land Abuja, J's Place Hotel provides accommodations with a restaurant, free private parking and a bar. "
  },
  {
    "name": "Knight bridge luxury apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "7.5 miles from Magic Land Abuja in Abuja, Knight bridge luxury apartments provides accommodations with access to a fitness center and indoor pool. "
  },
  {
    "name": "OD-V!CK'S BUDGET ROOMS, 24HR POWER, SECURITY, DSTV",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "OD-V!CK'S BUDGET ROOMS, 24HR POWER, SECURITY, DSTV provides air-conditioned accommodations in Abuja. This guest house features free private parking and a shared kitchen. "
  },
  {
    "name": "NO.1 HOTEL",
    "location": "Abuja",
    "ratings": 6.7,
    "starRating": null,
    "reviews": "15 reviews",
    "descriptions": "Located in Abuja, 4 miles from Magic Land Abuja, NO.1 HOTEL has accommodations with a garden, free private parking, a terrace and a restaurant. "
  },
  {
    "name": "Bulioni Hotels",
    "location": "Abuja",
    "ratings": null,
    "starRating": 3,
    "reviews": null,
    "descriptions": "Featuring 3-star accommodations, Bulioni Hotels is located in Abuja, 4.8 miles from IBB Golf Club and 5.4 miles from Magic Land Abuja. "
  },
  {
    "name": "5&6 Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "5&6 Apartment is located in Abuja, just 8.6 miles from IBB Golf Club and 10 miles from Magic Land Abuja. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Health Plaza Abuja",
    "location": "Abuja",
    "ratings": 7.8,
    "starRating": null,
    "reviews": "225 reviews",
    "descriptions": "4.6 miles from Magic Land Abuja in Abuja, Health Plaza Abuja offers accommodations with access to a fitness room. This condo hotel features free private parking, free shuttle service, and free Wifi. "
  },
  {
    "name": "Master's room studio with Stable Power, Fast WIFI, City center",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Master's room studio with Stable Power, Fast WIFI, City center offers accommodations in Abuja, 6.9 miles from Magic Land Abuja and 10 miles from IBB Golf Club. "
  },
  {
    "name": "Sudo Africa Amber",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Sudo Africa Amber offers accommodations in Abuja, 3.9 miles from Magic Land Abuja and 7 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Softlife apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Softlife apartments provides air-conditioned rooms in Abuja. Among the facilities at this property are a shared kitchen and full-day security, along with free Wifi throughout the property. "
  },
  {
    "name": "Checkers Suite & Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": 5,
    "reviews": null,
    "descriptions": "Located in Abuja, 12 miles from Magic Land Abuja, Checkers Suite & Apartments has accommodations with a garden, free private parking, a terrace and a restaurant. "
  },
  {
    "name": "One bedroom Sporshe Apartments Wuse 2",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "With free private parking, the property is 5 miles from Magic Land Abuja and 6.9 miles from IBB Golf Club. "
  },
  {
    "name": "Alder studio Apt+Gym+Snooker board. Rhodabode Nile",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "Alder studio Apt+Gym+Snooker board. Rhodabode Nile is located in Abuja, just 7 miles from Magic Land Abuja and 11 miles from IBB Golf Club. "
  },
  {
    "name": "Atelier Boutique Hotel",
    "location": "Abuja",
    "ratings": 7.9,
    "starRating": 4,
    "reviews": "88 reviews",
    "descriptions": "Located in Abuja, 3.4 miles from IBB Golf Club, Atelier Boutique Hotel provides accommodations with a garden, free private parking, a terrace and a restaurant. "
  },
  {
    "name": "Integral Consults Apartment",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "6 reviews",
    "descriptions": "Integral Consults Apartment is located in Abuja, just 6.9 miles from Magic Land Abuja and 9.4 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Trendy 2 Bedroom Apartment in Abuja",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "Trendy 2 Bedroom Apartment in Abuja is located in Abuja, just 6.6 miles from Magic Land Abuja and 12 miles from IBB Golf Club. The apartment features both Wifi and private parking free of charge. "
  },
  {
    "name": "Fraser Suites Abuja",
    "location": "Abuja",
    "ratings": 8.2,
    "starRating": 5,
    "reviews": "124 reviews",
    "descriptions": "Showcasing a year-round outdoor pool, Fraser Suites Abuja is located in Abuja.  Free WiFi is available throughout the property and free private parking is available on site. "
  },
  {
    "name": "Mayfair Hotel Wuse2 Abuja",
    "location": "Abuja",
    "ratings": 7.2,
    "starRating": 4,
    "reviews": "42 reviews",
    "descriptions": "Located in Abuja, 3.7 miles from Magic Land Abuja, Mayfair Hotel Wuse2 Abuja provides accommodations with a restaurant, free private parking and a bar. This 4-star hotel offers a concierge service. "
  },
  {
    "name": "Miraph Apartment",
    "location": "Abuja",
    "ratings": 7.7,
    "starRating": null,
    "reviews": "39 reviews",
    "descriptions": "Miraph Apartment is located in Abuja, just 6 miles from Magic Land Abuja and 12 miles from IBB Golf Club. This apartment provides free private parking, a 24-hour front desk, and free Wifi. "
  },
  {
    "name": "C7 Hazelwood Residence & Suites",
    "location": "Abuja",
    "ratings": 8.4,
    "starRating": null,
    "reviews": "74 reviews",
    "descriptions": "C7 Hazelwood Residence & Suites provides air-conditioned rooms in Abuja. With free private parking, the property is 10 miles from Magic Land Abuja and 15 miles from IBB Golf Club. "
  },
  {
    "name": "Luxistt Apartment Abuja",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Luxistt Apartment Abuja is located in Abuja, just 4.2 miles from Magic Land Abuja and 8 miles from IBB Golf Club. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "The epicenter luxury",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "The epicenter luxury offers accommodations in Abuja, 7.4 miles from Magic Land Abuja and 13 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Prosbel Hotel",
    "location": "Abuja",
    "ratings": 7.6,
    "starRating": null,
    "reviews": "11 reviews",
    "descriptions": "Located in Abuja, 4.5 miles from IBB Golf Club, Prosbel Hotel provides accommodations with an outdoor swimming pool, free private parking, a terrace and a restaurant. "
  },
  {
    "name": "Merryway Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Merryway Apartments offers accommodations in Abuja, 4.9 miles from Magic Land Abuja and 8.2 miles from IBB Golf Club. "
  },
  {
    "name": "Glovis Exclusive Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "A recently renovated apartment, Glovis Exclusive Apartments offers accommodations in Abuja. This apartment provides free private parking, a 24-hour front desk, and free Wifi. "
  },
  {
    "name": "FLAT 20",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "FLAT 20 offers accommodations in Abuja, 6.8 miles from IBB Golf Club. "
  },
  {
    "name": "THE HOUSE ABUJA",
    "location": "Abuja",
    "ratings": 7.4,
    "starRating": null,
    "reviews": "7 reviews",
    "descriptions": "Located in Abuja, 3.7 miles from Magic Land Abuja, THE HOUSE ABUJA provides accommodations with a garden, free private parking, a shared lounge and a terrace. "
  },
  {
    "name": "CRYSTAL HOUSE",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "CRYSTAL HOUSE offers accommodations in Abuja, 4.2 miles from IBB Golf Club and 7.1 miles from Magic Land Abuja. This apartment provides free private parking, an elevator, and free Wifi. "
  },
  {
    "name": "Nexus Xpress Hotel",
    "location": "Abuja",
    "ratings": 8.2,
    "starRating": 3,
    "reviews": "20 reviews",
    "descriptions": "Located in Abuja, 10 miles from Magic Land Abuja, Nexus Xpress Hotel provides accommodations with a shared lounge, free private parking, a restaurant and a bar. "
  },
  {
    "name": "2 Bedroom and a kitchen.",
    "location": "Abuja",
    "ratings": 6,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "2 Bedroom and a kitchen. Offers accommodations in Abuja, 5.9 miles from IBB Golf Club. The air-conditioned accommodation is 3.6 miles from Magic Land Abuja. "
  },
  {
    "name": "Btech Homes",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Btech Homes is located in Abuja, just 7.1 miles from Magic Land Abuja and 9.5 miles from IBB Golf Club. This guest house provides air-conditioned accommodations with a balcony and free Wifi. "
  },
  {
    "name": "Elite Suites Abuja",
    "location": "Abuja",
    "ratings": 4.8,
    "starRating": null,
    "reviews": "5 reviews",
    "descriptions": "Located in Abuja, 7.9 miles from Magic Land Abuja, Elite Suites Abuja has accommodations with a garden, free private parking and a restaurant. "
  },
  {
    "name": "One Bedroom Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "One Bedroom Apartment is located in Abuja, just 10 miles from Magic Land Abuja and 12 miles from IBB Golf Club. This apartment features free private parking and free Wifi. "
  },
  {
    "name": "Five Homes Hotel and Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Offering a garden, Five Homes Hotel and Apartments offers accommodations in Abuja. This property offers access to a terrace, free private parking, and free Wifi. "
  },
  {
    "name": "Beeland Hotel and Guest Inn",
    "location": "Abuja",
    "ratings": 2.8,
    "starRating": null,
    "reviews": "4 reviews",
    "descriptions": "Located in Abuja, 10 miles from Magic Land Abuja, Beeland Hotel and Guest Inn has accommodations with a restaurant, free private parking and a bar. "
  },
  {
    "name": "Z98 Residence",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "Z98 Residence enjoys a location in Abuja, 8.2 miles from Magic Land Abuja and 13 miles from IBB Golf Club. This condo hotel provides a terrace. "
  },
  {
    "name": "Nes Luxury Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Nes Luxury Apartments is located in Abuja, just 7 miles from Magic Land Abuja and 10 miles from IBB Golf Club. This property offers access to a balcony, darts, free private parking, and free Wifi. "
  },
  {
    "name": "Marigold Hotel",
    "location": "Abuja",
    "ratings": 6.6,
    "starRating": 3,
    "reviews": "59 reviews",
    "descriptions": "Located in Abuja, 8.6 miles from Magic Land Abuja, Marigold Hotel provides accommodations with a restaurant, free private parking and a bar. "
  },
  {
    "name": "La Anna's apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "La Anna's apartment offers accommodations in Abuja, 4.4 miles from Magic Land Abuja and 10 miles from IBB Golf Club. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "Sommy's place 02",
    "location": "Abuja",
    "ratings": 9,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "Sommy's place 02 offers accommodations in Abuja, 4.2 miles from Magic Land Abuja and 4.9 miles from IBB Golf Club. The apartment also offers free Wifi and free private parking. "
  },
  {
    "name": "Sporshe Duplex",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Sporshe Duplex offers accommodations in Abuja, 6.3 miles from Magic Land Abuja and 8.8 miles from IBB Golf Club. This property offers access to a terrace and free private parking. "
  },
  {
    "name": "LIFTA APARTMENT",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Featuring a terrace, LIFTA APARTMENT provides accommodations in Abuja. With free private parking, the property is 5.6 miles from Magic Land Abuja and 10 miles from IBB Golf Club. "
  },
  {
    "name": "Milano Apartment",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "Milano Apartment offers accommodations in Abuja, 8.3 miles from Magic Land Abuja and 14 miles from IBB Golf Club. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "Salt Signature",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Salt Signature is located in Abuja, just 5.4 miles from Magic Land Abuja and 5.5 miles from IBB Golf Club. Both free Wifi and private parking are accessible at the apartment free of charge. "
  },
  {
    "name": "Exotic 2 bedroom apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Exotic 2 bedroom apartment is located in Abuja, just 5.4 miles from Magic Land Abuja and 11 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Monaco by Scotia Homes",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Monaco by Scotia Homes is located in Abuja, just 8.8 miles from Magic Land Abuja and 10 miles from IBB Golf Club. This property offers access to a terrace, free private parking, and free Wifi. "
  },
  {
    "name": "Flat 1, ECOWAS ESTATE",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Featuring a garden, Flat 1, ECOWAS ESTATE features accommodations in Abuja. With free private parking, the property is 8.9 miles from IBB Golf Club and 11 miles from Magic Land Abuja. "
  },
  {
    "name": "Elegance Oasis: Central 2BR Apartment with Balcony, View, and WiFI in Maitama",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Elegance Oasis: Central 2BR Apartment with Balcony, View, and WiFI in Maitama offers accommodations in Abuja, 4.4 miles from IBB Golf Club and 9.2 miles from Magic Land Abuja. "
  },
  {
    "name": "Vantage Home",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Vantage Home is located in Abuja, just 4.3 miles from Magic Land Abuja and 6.3 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "1 bedroom apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "1 bedroom apartment is located in Abuja, just 4.5 miles from Magic Land Abuja and 10 miles from IBB Golf Club. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "Grand Bohabs Hotel",
    "location": "Abuja",
    "ratings": null,
    "starRating": 4,
    "reviews": null,
    "descriptions": "Located in Abuja, 4.3 miles from Magic Land Abuja, Grand Bohabs Hotel has accommodations with a restaurant, free private parking and a bar. "
  },
  {
    "name": "House 55 Apartments",
    "location": "Abuja",
    "ratings": 8.8,
    "starRating": null,
    "reviews": "12 reviews",
    "descriptions": "House 55 Apartments enjoys a location in Abuja, 7.5 miles from Magic Land Abuja and 12 miles from IBB Golf Club. This apartment provides free private parking, full-day security, and free Wifi. "
  },
  {
    "name": "Tastefully-Furnished One-Bedroom Apartment in Wuye",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Tastefully-Furnished One-Bedroom Apartment in Wuye is located in Abuja, just 2.3 miles from Magic Land Abuja and 10 miles from IBB Golf Club. "
  },
  {
    "name": "Luxury 2 Bedroom Classic Apartment Abuja",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "Luxury 2 Bedroom Classic Apartment Abuja offers accommodations in Abuja, 2.4 miles from Magic Land Abuja and 9.5 miles from IBB Golf Club. "
  },
  {
    "name": "Luxury 2 Bedroom Apartment in the Heart of WUSE 2, WIFI,NETFLIX, 24hrs Light",
    "location": "Abuja",
    "ratings": 8.3,
    "starRating": null,
    "reviews": "7 reviews",
    "descriptions": "Luxury 2 Bedroom Apartment in the Heart of WUSE 2, WIFI, NETFLIX, 24hrs Light is a recently renovated apartment in Abuja where guests can make the most of the garden and bar. "
  },
  {
    "name": "Atlantic Experiences, Garki, Abuja",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "A recently renovated apartment, Atlantic Experiences, Garki, Abuja offers accommodation in Abuja. This property offers access to a patio, free private parking, and free Wifi. "
  },
  {
    "name": "The-Loft's Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "The-Loft's Apartments offers accommodations in Abuja, 7 miles from IBB Golf Club. "
  },
  {
    "name": "Luxury Affordable 3 Bedroom Apartment",
    "location": "Abuja",
    "ratings": 9,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "Luxury Affordable 3 Bedroom Apartment is located in Abuja, just 4.6 miles from Magic Land Abuja and 10 miles from IBB Golf Club. "
  },
  {
    "name": "Luxe Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Luxe Apartment offers accommodations in Abuja, 5.2 miles from Magic Land Abuja and 10 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Sommy's place 5",
    "location": "Abuja",
    "ratings": 9,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "Sommy's place 5 is located in Abuja, just 4.5 miles from Magic Land Abuja and 10 miles from IBB Golf Club. The apartment features free Wifi and free private parking. "
  },
  {
    "name": "Lumiere apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Lumiere apartments offers accommodations in Abuja, 6.5 miles from Magic Land Abuja and 12 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Lush Meadows Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Lush Meadows Apartments enjoys a location in Abuja, 7.2 miles from Magic Land Abuja and 10 miles from IBB Golf Club. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "Stay&Homely",
    "location": "Abuja",
    "ratings": null,
    "starRating": 5,
    "reviews": null,
    "descriptions": "Located in Abuja, 4.6 miles from IBB Golf Club, Stay&Homely provides accommodations with a garden, free private parking, a terrace and a restaurant. "
  },
  {
    "name": "Carlton Apex Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Carlton Apex Apartments is located in Abuja, just 4.8 miles from Magic Land Abuja and 9.2 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Wulvan Hotel",
    "location": "Abuja",
    "ratings": null,
    "starRating": 3,
    "reviews": null,
    "descriptions": "Located in Abuja, 9.2 miles from IBB Golf Club, Wulvan Hotel has accommodations with a garden, free private parking, a restaurant and a bar. "
  },
  {
    "name": "luxury apartment in jabi",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Luxury apartment in jabi offers accommodations in Abuja, 4.5 miles from Magic Land Abuja and 10 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi...."
  },
  {
    "name": "HP Pavilion",
    "location": "Abuja",
    "ratings": 7.9,
    "starRating": null,
    "reviews": "37 reviews",
    "descriptions": "HP Pavilion features a hot tub and free private parking, and is within 4.9 miles of Magic Land Abuja and 6.2 miles of IBB Golf Club. "
  },
  {
    "name": "Thurayya&zaheed luxury",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "Thurayya&zaheed luxury is located in Abuja, just 7.4 miles from Magic Land Abuja and 13 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Reiz Continental Hotel",
    "location": "Abuja",
    "ratings": null,
    "starRating": 4,
    "reviews": null,
    "descriptions": "Located in Abuja, 3 miles from Magic Land Abuja, Reiz Continental Hotel has accommodations with free WiFi and free private parking. This 4-star hotel offers a 24-hour front desk. "
  },
  {
    "name": "Orange Roof Lodge",
    "location": "Abuja",
    "ratings": 7.7,
    "starRating": null,
    "reviews": "60 reviews",
    "descriptions": "Located in Abuja, 4.2 miles from IBB Golf Club, Orange Roof Lodge provides accommodations with a shared lounge, free private parking, a terrace and a bar. "
  },
  {
    "name": "aPogee Home",
    "location": "Abuja",
    "ratings": 8,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "APogee Home offers accommodations in Abuja, 5.5 miles from Magic Land Abuja and 12 miles from IBB Golf Club. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "BW Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "BW Apartment offers accommodations in Abuja, 2.9 miles from Magic Land Abuja and 10 miles from IBB Golf Club. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "Urbanloft Apartment",
    "location": "Abuja",
    "ratings": 8.6,
    "starRating": null,
    "reviews": "5 reviews",
    "descriptions": "Urbanloft Apartment in Abuja provides accommodations with a terrace and a shared lounge. This guest house features free private parking, a shared kitchen, and free Wifi. "
  },
  {
    "name": "2 Bedroom, 1 Bedroom Wuse 2 extension JAHI",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "2 Bedroom, 1 Bedroom Wuse 2 extension JAHI offers accommodations in Abuja, 6.9 miles from IBB Golf Club. "
  },
  {
    "name": "Apartment One One",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Apartment One One is located in Abuja, just 11 miles from Magic Land Abuja and 15 miles from IBB Golf Club. Both Wifi and private parking are available at the apartment free of charge. "
  },
  {
    "name": "Luxe Apartment Wuse 24hrs power WI-FI",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "With free private parking, the property is 2.9 miles from Magic Land Abuja and 6.4 miles from IBB Golf Club. "
  },
  {
    "name": "Grey Villa - 3 bedroom Duplex",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Grey Villa - 3 bedroom Duplex is located in Abuja, just 14 miles from IBB Golf Club and 16 miles from Magic Land Abuja. This property offers access to a terrace, free private parking, and free Wifi. "
  },
  {
    "name": "Alnavi Homes ShortStay Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Alnavi Homes ShortStay Apartment is located in Abuja, just 16 miles from IBB Golf Club and 18 miles from Magic Land Abuja. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "House 7 Mbora: 2 Bedroom apartment. Beyond A hotel room. Total Privacy. A home away from home.",
    "location": "Abuja",
    "ratings": 7,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "House 7 Mbora: 2 Bedroom apartment. Beyond A hotel room. Total Privacy. A home away from home. Is located in Abuja, just 6.6 miles from Magic Land Abuja and 13 miles from IBB Golf Club. "
  },
  {
    "name": "Wofty, 3 Bedroom Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Featuring a garden, Wofty, 3 Bedroom Apartment provides accommodations in Abuja. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Samuel Court",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Samuel Court in Abuja provides accommodations with a garden, a terrace, and a shared lounge. There's a private entrance at the resort village for the convenience of those who stay. "
  },
  {
    "name": "Sophy Shortlet",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "This recently renovated apartment is located 3.9 miles from Magic Land Abuja and 8.4 miles from IBB Golf Club. "
  },
  {
    "name": "Cc & Cg Homes 4 Bedroom Duplex-24Hrs Electricity WIFI Security",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "3 reviews",
    "descriptions": "Cc & Cg Homes 4 Bedroom Duplex-24Hrs Electricity WIFI Security is located in Abuja, just 5.5 miles from Magic Land Abuja and 12 miles from IBB Golf Club. "
  },
  {
    "name": "The Aria Suite, 2BDR APT",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "The Aria Suite, 2BDR APT offers accommodations in Abuja, 10 miles from Magic Land Abuja and 11 miles from IBB Golf Club. This apartment provides free private parking, full-day security, and free Wifi...."
  },
  {
    "name": "Tulip Room",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Tulip Room offers accommodations in Abuja, 5.1 miles from IBB Golf Club and 6.9 miles from Magic Land Abuja. This homestay offers air-conditioned accommodations with a balcony and free Wifi. "
  },
  {
    "name": "Rexempress",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Rexempress is located in Abuja, just 14 miles from IBB Golf Club and 16 miles from Magic Land Abuja. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Lovely Studio-City center",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Lovely Studio-City center offers accommodations in Abuja, 6.9 miles from Magic Land Abuja and 10 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free..."
  },
  {
    "name": "KAMS Clubhouse Lifecamp, 24 power",
    "location": "Abuja",
    "ratings": 7.5,
    "starRating": null,
    "reviews": "12 reviews",
    "descriptions": "Located 7.1 miles from Magic Land Abuja, KAMS Clubhouse Lifecamp, 24 power has accommodations with a shared lounge, a terrace and a shared kitchen for your convenience. "
  },
  {
    "name": "Penda wheels and stays",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Penda wheels and stays offers accommodations in Abuja, 4.3 miles from IBB Golf Club and 5.9 miles from Magic Land Abuja. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Fabino by Top Rank Hotels",
    "location": "Abuja",
    "ratings": 2,
    "starRating": 4,
    "reviews": "2 reviews",
    "descriptions": "Located in Abuja, 4.5 miles from IBB Golf Club, Fabino by Top Rank Hotels provides accommodations with a garden, free private parking, a terrace and a restaurant. "
  },
  {
    "name": "LUXE Apartment @ Wuse *WI-FI *24/7 Light",
    "location": "Abuja",
    "ratings": 3,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "LUXE Apartment @ Wuse *WI-FI *24/7 Light offers accommodations in Abuja, 2.9 miles from Magic Land Abuja and 6.4 miles from IBB Golf Club. "
  },
  {
    "name": "Hendon Ivy Apartment",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "8.5 miles from IBB Golf Club in Abuja, Hendon Ivy Apartment provides accommodations with access to a fitness room. "
  },
  {
    "name": "Comfy & Central 2-Bedroom Apt. Wuse 2.",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Comfy & Central 2-Bedroom Apt. Wuse 2. Is located in Abuja, just 3.9 miles from Magic Land Abuja and 7 miles from IBB Golf Club. "
  },
  {
    "name": "GAZANIA CLASSIC SUITE, RHODABODE APT.",
    "location": "Abuja",
    "ratings": 9.1,
    "starRating": null,
    "reviews": "11 reviews",
    "descriptions": "GAZANIA CLASSIC SUITE, RHODABODE APT. Offers accommodations in Abuja, 11 miles from IBB Golf Club. "
  },
  {
    "name": "Outstand Uphoria Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Outstand Uphoria Apartment offers accommodations in Abuja, 3.5 miles from Magic Land Abuja and 7.8 miles from IBB Golf Club. This guest house features a bar. "
  },
  {
    "name": "HECTOR LUXURY APARTMENT",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "HECTOR LUXURY APARTMENT offers accommodations in Abuja, 12 miles from IBB Golf Club. The air-conditioned accommodation is 8.7 miles from Magic Land Abuja. "
  },
  {
    "name": "Sommy's",
    "location": "Abuja",
    "ratings": 8.5,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "Sommy's offers accommodations in Abuja, 4.5 miles from Magic Land Abuja and 10 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Aster",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Aster is located in Abuja, just 3.8 miles from Magic Land Abuja and 6.1 miles from IBB Golf Club. The apartment also offers free Wifi and free private parking. "
  },
  {
    "name": "Kolebus Luxury Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Kolebus Luxury Apartments offers accommodations in Abuja, 3.6 miles from IBB Golf Club and 8.4 miles from Magic Land Abuja. "
  },
  {
    "name": "Neovantex I",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Neovantex I is located in Abuja, just 10 miles from Magic Land Abuja and 14 miles from IBB Golf Club. This property offers access to a terrace and free private parking. "
  },
  {
    "name": "5 Homes Hotel and Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Located in Abuja, 5.9 miles from Magic Land Abuja, 5 Homes Hotel and Apartments has accommodations with a terrace, free private parking, a restaurant and a bar. "
  },
  {
    "name": "Amazing one bedroom flat",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Amazing one bedroom flat offers accommodations in Abuja, 5.2 miles from Magic Land Abuja and 5.6 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free..."
  },
  {
    "name": "The Hidden Gem Wuye",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "The Hidden Gem Wuye offers accommodations in Abuja, 1.1 miles from Magic Land Abuja and 10 miles from IBB Golf Club. This homestay offers free private parking, a shared kitchen, and free Wifi. "
  },
  {
    "name": "Sury Luxury",
    "location": "Abuja",
    "ratings": 8,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "Offering a garden, Sury Luxury offers accommodations in Abuja. Among the facilities of this property are a restaurant, an elevator, and full-day security, along with free Wifi throughout the property...."
  },
  {
    "name": "Lovely one-bedroom rental apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Lovely one-bedroom rental apartment is located in Abuja, just 9.1 miles from IBB Golf Club and 11 miles from Magic Land Abuja. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "exquisite and lavishly furnished 3-bedroom flat",
    "location": "Abuja",
    "ratings": 8,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "Exquisite and lavishly furnished 3-bedroom flat is located in Abuja, just 1.9 miles from Magic Land Abuja and 9.1 miles from IBB Golf Club. "
  },
  {
    "name": "Dozubel Hotel",
    "location": "Abuja",
    "ratings": 8.5,
    "starRating": 4,
    "reviews": "2 reviews",
    "descriptions": "Located in Abuja, 4.8 miles from Magic Land Abuja, Dozubel Hotel provides accommodations with an outdoor swimming pool, free private parking, a garden and a restaurant. This 4-star hotel offers a bar...."
  },
  {
    "name": "Aston Luxury Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Aston Luxury Apartments offers accommodations in Abuja, 5.7 miles from Magic Land Abuja and 9 miles from IBB Golf Club. This property offers access to a terrace, free private parking, and free Wifi. "
  },
  {
    "name": "Jormanic Prime Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Jormanic Prime Apartments offers accommodations in Abuja, 3.9 miles from Magic Land Abuja. "
  },
  {
    "name": "Cozy 1 bedroom apartment in Abuja",
    "location": "Abuja",
    "ratings": 8,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "Cozy 1 bedroom apartment in Abuja is located in Abuja, just 10 miles from Magic Land Abuja and 13 miles from IBB Golf Club. The apartment provides free Wifi and free private parking. "
  },
  {
    "name": "House 121",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "House 121 offers accommodations in Abuja, 7 miles from Magic Land Abuja and 8.6 miles from IBB Golf Club. This condo hotel provides a garden. "
  },
  {
    "name": "STUDIO WITH PRIVATE ENTRANCE- WIFI",
    "location": "Abuja",
    "ratings": 7,
    "starRating": null,
    "reviews": "7 reviews",
    "descriptions": "STUDIO WITH PRIVATE ENTRANCE- WIFI offers accommodations in Abuja, 4.7 miles from IBB Golf Club and 6.8 miles from Magic Land Abuja. The apartment provides both free Wifi and free private parking. "
  },
  {
    "name": "Cc & Cg Homes Luxury 4-Beds Apart Abuja-24Hrs Power",
    "location": "Abuja",
    "ratings": 4,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "3.2 miles from Magic Land Abuja in Abuja, Cc & Cg Homes Luxury 4-Beds Apart Abuja-24Hrs Power provides accommodations with access to spa facilities and beauty services. "
  },
  {
    "name": "Otk's Apartment",
    "location": "Abuja",
    "ratings": 9.6,
    "starRating": 4,
    "reviews": "5 reviews",
    "descriptions": "Located in Abuja, 8.2 miles from Magic Land Abuja, Otk's Apartment has accommodations with an outdoor swimming pool, free private parking, a shared lounge and a restaurant. "
  },
  {
    "name": "Asfranz Studio Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "With free private parking, the property is 5.2 miles from Magic Land Abuja and 8.6 miles from IBB Golf Club. The apartment is composed of 1 bedroom, a fully equipped kitchenette, and 1 bathroom. "
  },
  {
    "name": "Claramojisola -Eunice Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Claramojisola -Eunice Apartment offers accommodations in Abuja, 2.6 miles from Magic Land Abuja and 6.9 miles from IBB Golf Club. This property offers access to a terrace and free private parking. "
  },
  {
    "name": "Micasa Shortlets",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Micasa Shortlets offers accommodations in Abuja, 10 miles from Magic Land Abuja and 13 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Hotel 5092",
    "location": "Abuja",
    "ratings": 9,
    "starRating": 3,
    "reviews": "2 reviews",
    "descriptions": "Hotel 5092 is located in Abuja, within 3.6 miles of IBB Golf Club and 8.4 miles of Magic Land Abuja. With free WiFi, this 3-star hotel offers room service and a 24-hour front desk. "
  },
  {
    "name": "Plushly-Furnished Three-Bedroom Apartment in Wuye",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Plushly-Furnished Three-Bedroom Apartment in Wuye is located in Abuja, just a 13-minute walk from Magic Land Abuja and 9.4 miles from IBB Golf Club. "
  },
  {
    "name": "luxury studio in jabi",
    "location": "Abuja",
    "ratings": 8.5,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "Luxury studio in jabi is located in Abuja, just 4.5 miles from Magic Land Abuja and 10 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Daesil homes 3 Abuja",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "A recently renovated apartment, Daesil homes 3 Abuja offers accommodations in Abuja. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Phoenix Luxury Apartments",
    "location": "Abuja",
    "ratings": 8.5,
    "starRating": null,
    "reviews": "8 reviews",
    "descriptions": "Featuring quiet street views, Phoenix Luxury Apartments in Abuja offers accommodations and a shared lounge. "
  },
  {
    "name": "Luxury Oasis 2 - Entire 2 Bedroom Apartment in Abuja with Pool, Gym, WiFi, Balcony, and Garden",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Luxury Oasis 2 - Entire 2 Bedroom Apartment in Abuja with Pool, Gym, WiFi, Balcony, and Garden is located in Abuja, just 4.6 miles from Magic Land Abuja and 7.2 miles from IBB Golf Club. "
  },
  {
    "name": "The Pine Court Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Offering a terrace, The Pine Court Apartments offers accommodations in Abuja. This apartment provides free private parking, full-day security, and free Wifi. "
  },
  {
    "name": "Mayor Shortlet",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "The air-conditioned accommodation is 8.2 miles from IBB Golf Club. Free Wifi is available throughout the property and Magic Land Abuja is 3.8 miles away. "
  },
  {
    "name": "House 24",
    "location": "Abuja",
    "ratings": 7.1,
    "starRating": 3,
    "reviews": "10 reviews",
    "descriptions": "Located in Abuja, 3.4 miles from IBB Golf Club, House 24 has accommodations with a garden, free private parking, a terrace and a restaurant. "
  },
  {
    "name": "Amaks Shelter",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Amaks Shelter is located in Abuja, just 6.1 miles from Magic Land Abuja and 11 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Sophy’s home away from home",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Sophy’s home away from home offers air-conditioned rooms in Abuja. This property offers access to a terrace and free private parking. "
  },
  {
    "name": "Luxurious and Spacious Apartment in Wuye",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Luxurious and Spacious Apartment in Wuye offers accommodations in Abuja, 1.8 miles from Magic Land Abuja and 9.1 miles from IBB Golf Club. "
  },
  {
    "name": "3 bedroom furnished apartment in the heart of wuse 2",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "3 bedroom furnished apartment in the heart of wuse 2 offers accommodations in Abuja, 4.6 miles from IBB Golf Club and 5.3 miles from Magic Land Abuja. "
  },
  {
    "name": "7rockvalemanors",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "7rockvalemanors offers accommodations in Abuja, 6.9 miles from Magic Land Abuja and 9.5 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "AyahsCourt",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Featuring a garden, AyahsCourt features accommodations in Abuja. This property offers access to a terrace, free private parking, and free Wifi. "
  },
  {
    "name": "Porsche Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Porsche Apartment is located in Abuja, just 8.6 miles from Magic Land Abuja and 8.9 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Urban View Lodge - Apt.5 Room 1",
    "location": "Abuja",
    "ratings": 8.7,
    "starRating": null,
    "reviews": "3 reviews",
    "descriptions": "Urban View Lodge - Apt.5 Room 1 offers accommodations in Abuja, 5.1 miles from Magic Land Abuja. "
  },
  {
    "name": "OD-V!CK'S POSH APARTMENTS, WUYE DISTRICT, WiFi, 24hr power, Smart tv, Security, Dstv",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Providing a garden, OD-V!CK'S POSH APARTMENTS, WUYE DISTRICT, WiFi, 24hr power, Smart tv, Security, Dstv provides accommodations in Abuja. "
  },
  {
    "name": "Upscale Smart 2 Bedroom Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "7.8 miles from IBB Golf Club in Abuja, Upscale Smart 2 Bedroom Apartment provides accommodations with access to a hot tub. "
  },
  {
    "name": "SS3 Jabi Hotel",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Located in Abuja, 5.1 miles from Magic Land Abuja, SS3 Jabi Hotel provides accommodations with a restaurant, free private parking and a bar. "
  },
  {
    "name": "Kampe 3 Bedroom Luxury",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Offering a bar, Kampe 3 Bedroom Luxury offers accommodations in Abuja. "
  },
  {
    "name": "Rereluxshortlets",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Located in Abuja, 7.4 miles from Magic Land Abuja, Rereluxshortlets provides accommodations with a restaurant, free private parking and a bar. "
  },
  {
    "name": "All States Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Featuring a garden, All States Apartment features accommodations in Abuja. With free private parking, the property is 16 miles from IBB Golf Club and 18 miles from Magic Land Abuja. "
  },
  {
    "name": "The Pines Court Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "A recently renovated apartment, The Pines Court Apartments offers accommodations in Abuja. With quiet street views, this accommodation offers a terrace. "
  },
  {
    "name": "Modern Luxury Home W/ 24H Power Wi-Fi & Security",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "6.8 miles from Magic Land Abuja in Abuja, Modern Luxury Home W/ 24H Power Wi-Fi & Security provides accommodations with access to a hot tub. "
  },
  {
    "name": "Michealplatz",
    "location": "Abuja",
    "ratings": 8,
    "starRating": null,
    "reviews": "4 reviews",
    "descriptions": "Michealplatz is located in Abuja, just 10 miles from IBB Golf Club and 12 miles from Magic Land Abuja. This property offers access to a terrace, free private parking, and free Wifi. "
  },
  {
    "name": "Ugo Homes",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Ugo Homes is located in Abuja, just 9.3 miles from Magic Land Abuja and 14 miles from IBB Golf Club. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "Naya's Apartment: A Lush Ambience (Katampe, Abuja)",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Naya's Apartment: A Lush Ambience (Katampe, Abuja) offers accommodations in Abuja, 6.2 miles from IBB Golf Club and 8 miles from Magic Land Abuja. "
  },
  {
    "name": "Well furnished and spacious 2 bedroom apartment",
    "location": "Abuja",
    "ratings": 9.1,
    "starRating": null,
    "reviews": "7 reviews",
    "descriptions": "Well furnished and spacious 2 bedroom apartment offers accommodations in Abuja, 6.2 miles from Magic Land Abuja and 11 miles from IBB Golf Club. "
  },
  {
    "name": "Derah’s enterprises",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Derah’s enterprises offers accommodations in Abuja, 6.1 miles from Magic Land Abuja and 8.2 miles from IBB Golf Club. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "Asfranz Apartment One-Bedroom Apartment @ Wuse 2",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "With free private parking, the property is 3.7 miles from Magic Land Abuja and 5.9 miles from IBB Golf Club. "
  },
  {
    "name": "Adel’s Place",
    "location": "Abuja",
    "ratings": 9.3,
    "starRating": null,
    "reviews": "8 reviews",
    "descriptions": "With free private parking, the property is 4.7 miles from IBB Golf Club and 5.4 miles from Magic Land Abuja. "
  },
  {
    "name": "Atlantic Court Apartment",
    "location": "Abuja",
    "ratings": 6.3,
    "starRating": null,
    "reviews": "3 reviews",
    "descriptions": "Atlantic Court Apartment is located in Abuja, just 5.6 miles from Magic Land Abuja and 8.2 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Hamasville Boutique Hotel",
    "location": "Abuja",
    "ratings": 7,
    "starRating": 3,
    "reviews": "1 review",
    "descriptions": "Located in Abuja, 3.1 miles from Magic Land Abuja, Hamasville Boutique Hotel provides accommodations with an outdoor swimming pool, free private parking, a garden and a shared lounge. "
  },
  {
    "name": "Rivalex Apartment and Rooftop",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Rivalex Apartment and Rooftop offers accommodations in Abuja, 3.1 miles from Magic Land Abuja and 7.1 miles from IBB Golf Club. The apartment features both Wifi and private parking free of charge. "
  },
  {
    "name": "Amaks Shelter",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Amaks Shelter offers accommodations in Abuja, 8.1 miles from Magic Land Abuja and 11 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Homely Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Providing a bar, Homely Apartment features accommodations in Abuja. This property offers access to a terrace, free private parking, and free Wifi. "
  },
  {
    "name": "Lakehouse Apartment - Lake Ontario - One Bedroom Apartment",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "With free private parking, the property is 2.3 miles from Magic Land Abuja and 10 miles from IBB Golf Club. "
  },
  {
    "name": "GVS Luxury Suite & Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "GVS Luxury Suite & Apartment is located in Abuja, just 4.8 miles from Magic Land Abuja and 9.1 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Belhsreside",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Belhsreside offers accommodations in Abuja, 3.7 miles from Magic Land Abuja and 5.5 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Cozy Apartment in Abuja",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Cozy Apartment in Abuja offers accommodations in Abuja, 3 miles from Magic Land Abuja and 8.8 miles from IBB Golf Club. "
  },
  {
    "name": "One Bedroom Apartment wuse2",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "With free private parking, the property is 4.2 miles from Magic Land Abuja and 6.8 miles from IBB Golf Club. The apartment is composed of 1 bedroom, a fully equipped kitchen, and 1 bathroom. "
  },
  {
    "name": "M Guesthouse",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "M Guesthouse is a recently renovated apartment in Abuja where guests can make the most of the garden and shared lounge. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Events & Suites",
    "location": "Abuja",
    "ratings": 7,
    "starRating": null,
    "reviews": "46 reviews",
    "descriptions": "Located in Abuja, 5.7 miles from Magic Land Abuja, Events & Suites provides accommodations with a garden, free private parking, a shared lounge and a terrace. "
  },
  {
    "name": "De myas apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "De myas apartments offers accommodations in Abuja, 8.4 miles from Magic Land Abuja and 11 miles from IBB Golf Club. Guests staying at this apartment have access to a balcony. "
  },
  {
    "name": "Remarkable 3-Beds Apartment in Abuja",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Remarkable 3-Beds Apartment in Abuja offers accommodations in Abuja, 3.7 miles from Magic Land Abuja and 5.8 miles from IBB Golf Club. "
  },
  {
    "name": "Stobi Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Stobi Apartment offers accommodations in Abuja, 13 miles from IBB Golf Club and 14 miles from Magic Land Abuja. The apartment features both Wifi and private parking free of charge. "
  },
  {
    "name": "Lexrach Luxury Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Lexrach Luxury Apartments is located in Abuja, just 3.7 miles from Magic Land Abuja and 8 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Joefad Home Stay - Wuse Zone 5",
    "location": "Abuja",
    "ratings": 7.1,
    "starRating": null,
    "reviews": "52 reviews",
    "descriptions": "Joefad Home Stay - Wuse Zone 5 offers air-conditioned accommodations in Abuja. There's a private entrance at the guest house for the convenience of those who stay. "
  },
  {
    "name": "Sun Heaven Hotel & Resort Abuja",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Located in Abuja, 5.3 miles from IBB Golf Club, Sun Heaven Hotel & Resort Abuja has accommodations with free WiFi and free private parking. The hotel has family rooms. "
  },
  {
    "name": "Sleek Haven",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Sleek Haven offers accommodations in Abuja, 4.3 miles from Magic Land Abuja and 8.2 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "All States Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "All States Apartments offers accommodations in Abuja, 16 miles from IBB Golf Club and 18 miles from Magic Land Abuja. This property offers access to a terrace, free private parking, and free Wifi. "
  },
  {
    "name": "ADDRESS HOTELS AND TOWERS MAITAMA",
    "location": "Abuja",
    "ratings": 10,
    "starRating": 4,
    "reviews": "1 review",
    "descriptions": "ADDRESS HOTELS AND TOWERS MAITAMA is located in Abuja, within 4.6 miles of IBB Golf Club and 6.8 miles of Magic Land Abuja. "
  },
  {
    "name": "RLP",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "RLP is located in Abuja, just 7.4 miles from Magic Land Abuja and 12 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Dixonlux Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Dixonlux Apartments offers accommodations in Abuja, 7.2 miles from Magic Land Abuja and 12 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "La Anna's apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "La Anna's apartment is located in Abuja, just 4.4 miles from Magic Land Abuja and 10 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Gifted Apartment & Residence",
    "location": "Abuja",
    "ratings": 5.4,
    "starRating": null,
    "reviews": "7 reviews",
    "descriptions": "Gifted Apartment & Residence enjoys a location in Abuja, 3.9 miles from Magic Land Abuja and 5.4 miles from IBB Golf Club. "
  },
  {
    "name": "Wofty 1 bedroom apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Wofty 1 bedroom apartment is located in Abuja, just 4.7 miles from IBB Golf Club and 6.8 miles from Magic Land Abuja. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Kicc Lounge",
    "location": "Abuja",
    "ratings": null,
    "starRating": 4,
    "reviews": null,
    "descriptions": "Located in Abuja, 17 miles from IBB Golf Club, Kicc Lounge provides accommodations with a garden, free private parking, a restaurant and a bar. "
  },
  {
    "name": "Asfranz Apartment (Luxury One-Bedroom with Private Garden))",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "Asfranz Apartment (Luxury One-Bedroom with Private Garden)) is located in Abuja, just 5.5 miles from Magic Land Abuja and 8.5 miles from IBB Golf Club. "
  },
  {
    "name": "De-Omega Digital Homes, Service Apartment - Wuye Abuja",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Featuring a terrace, De-Omega Digital Homes, Service Apartment - Wuye Abuja features accommodations in Abuja. The air-conditioned accommodation is 3.1 miles from Magic Land Abuja. "
  },
  {
    "name": "MO-House Hotels Kubwa",
    "location": "Abuja",
    "ratings": null,
    "starRating": 3,
    "reviews": null,
    "descriptions": "Located in Abuja, 16 miles from IBB Golf Club, MO-House Hotels Kubwa has accommodations with an outdoor swimming pool, free private parking, a garden and a restaurant. "
  },
  {
    "name": "BRENTFORD RETRO",
    "location": "Abuja",
    "ratings": 8.7,
    "starRating": null,
    "reviews": "6 reviews",
    "descriptions": "BRENTFORD RETRO enjoys a location in Abuja, 3.8 miles from IBB Golf Club and 4.5 miles from Magic Land Abuja. This apartment offers free private parking, a 24-hour front desk, and free Wifi. "
  },
  {
    "name": "Bogotá by Homefront Encanto",
    "location": "Abuja",
    "ratings": 7.5,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "A recently renovated apartment, Bogotá by Homefront Encanto offers accommodations in Abuja. This apartment offers free private parking, full-day security, and free Wifi. "
  },
  {
    "name": "Sparkles Apartments",
    "location": "Abuja",
    "ratings": 7.5,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "Sparkles Apartments offers accommodations in Abuja, 5.1 miles from Magic Land Abuja and 8.1 miles from IBB Golf Club. There's a private entrance at the apartment for the convenience of those who stay...."
  },
  {
    "name": "MetroStay Apartments Abuja",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "MetroStay Apartments Abuja offers accommodations in Abuja, 8.5 miles from Magic Land Abuja and 14 miles from IBB Golf Club. "
  },
  {
    "name": "dreamland hotel",
    "location": "Abuja",
    "ratings": 6,
    "starRating": 3,
    "reviews": "3 reviews",
    "descriptions": "Located in Abuja, 6 miles from Magic Land Abuja, dreamland hotel has accommodations with a fitness center, free private parking, a garden and a terrace. "
  },
  {
    "name": "Apartment 104, Jamieson Court",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Apartment 104, Jamieson Court offers accommodations in Abuja, 10 miles from Magic Land Abuja. The air-conditioned accommodation is 8.4 miles from IBB Golf Club. "
  },
  {
    "name": "EvrythingLuxuryGreenland",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "EvrythingLuxuryGreenland offers accommodations in Abuja, 10 miles from Magic Land Abuja and 13 miles from IBB Golf Club. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "Address hotel and towers Abuja",
    "location": "Abuja",
    "ratings": 8,
    "starRating": 4,
    "reviews": "2 reviews",
    "descriptions": "Located in Abuja, 4.6 miles from IBB Golf Club, Address hotel and towers Abuja has accommodations with a restaurant, free private parking and a bar. "
  },
  {
    "name": "Nova Room 1 - Private Room in a Condo",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Nova Room 1 - Private Room in a Condo is located in Abuja, just 3.5 miles from Magic Land Abuja and 5.3 miles from IBB Golf Club. "
  },
  {
    "name": "Newly Furnished Cozy Apartment, City Centre",
    "location": "Abuja",
    "ratings": 8,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "Newly Furnished Cozy Apartment, City Centre is located in Abuja, just 2.4 miles from Magic Land Abuja and 10 miles from IBB Golf Club. "
  },
  {
    "name": "House of Dioma Apartments, Kubwa",
    "location": "Abuja",
    "ratings": 4.5,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "House of Dioma Apartments, Kubwa offers accommodations in Abuja, 18 miles from IBB Golf Club and 20 miles from Magic Land Abuja. "
  },
  {
    "name": "Cosystay Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Cosystay Apartment offers accommodations in Abuja, 4.4 miles from Magic Land Abuja. "
  },
  {
    "name": "The 9 apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "The 9 apartment is located in Abuja, just 7.3 miles from Magic Land Abuja and 12 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Trivins Serviced Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Trivins Serviced Apartment offers accommodations in Abuja, 16 miles from Magic Land Abuja. "
  },
  {
    "name": "KADAL APARTMENTS",
    "location": "Abuja",
    "ratings": 1,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "Providing city views, KADAL APARTMENTS in Abuja offers accommodations and a terrace. With mountain views, this accommodation features a balcony and a swimming pool. "
  },
  {
    "name": "Ayahscourt",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Featuring a garden, Ayahscourt features accommodations in Abuja. This property offers access to a terrace, free private parking, and free Wifi. "
  },
  {
    "name": "DeJames Hotels and Suites",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "DeJames Hotels and Suites is a recently renovated condo hotel in Abuja where guests can make the most of its bar and shared lounge. "
  },
  {
    "name": "2Bedroom Luxury Apartment Wuse 2",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "2Bedroom Luxury Apartment Wuse 2 offers accommodations in Abuja, 3.7 miles from IBB Golf Club and 5.7 miles from Magic Land Abuja. "
  },
  {
    "name": "LOTUS EXECUTIVE SUITE, RHODABODE APT.",
    "location": "Abuja",
    "ratings": 9.7,
    "starRating": null,
    "reviews": "3 reviews",
    "descriptions": "LOTUS EXECUTIVE SUITE, RHODABODE APT. Offers accommodations in Abuja, 6.6 miles from Magic Land Abuja and 11 miles from IBB Golf Club. "
  },
  {
    "name": "Chez B&D Suites & Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Chez B&D Suites & Apartments enjoys a location in Abuja, 13 miles from Magic Land Abuja and 18 miles from IBB Golf Club. There's a terrace and guests can access free Wifi and free private parking. "
  },
  {
    "name": "Room in Lodge - Bahamas Hotels International",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Room in Lodge - Bahamas Hotels International is located in Abuja, just 4.8 miles from IBB Golf Club and 8.1 miles from Magic Land Abuja. "
  },
  {
    "name": "S-Room",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "S-Room offers accommodations in Abuja, 2.9 miles from Magic Land Abuja and 10 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Passerby suits",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Passerby suits offers accommodations in Abuja, 3.3 miles from Magic Land Abuja and 5.7 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Folio Spaces and Experiences",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Folio Spaces and Experiences offers accommodations in Abuja, 4.3 miles from IBB Golf Club and 5.8 miles from Magic Land Abuja. "
  },
  {
    "name": "Stylish and Spacious 3Bed Flat ShortLet Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Stylish and Spacious 3Bed Flat ShortLet Apartment offers accommodations in Abuja, 6.3 miles from Magic Land Abuja and 11 miles from IBB Golf Club. "
  },
  {
    "name": "Nicotel Apartments",
    "location": "Abuja",
    "ratings": 3.8,
    "starRating": null,
    "reviews": "4 reviews",
    "descriptions": "5.3 miles from Magic Land Abuja in Abuja, Nicotel Apartments provides accommodations with access to a hot tub. "
  },
  {
    "name": "Massachusetts Oasis Apt Abuja",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Massachusetts Oasis Apt Abuja offers accommodations in Abuja, 11 miles from IBB Golf Club. The air-conditioned accommodation is 3.1 miles from Magic Land Abuja. "
  },
  {
    "name": "Tulip",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Tulip is located in Abuja, just 3.9 miles from Magic Land Abuja and 7 miles from IBB Golf Club. Both free Wifi and parking on-site are accessible at the apartment free of charge. "
  },
  {
    "name": "One bedroom in Sunnyvale Estate",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "One bedroom in Sunnyvale Estate is located in Abuja, just 8.4 miles from Magic Land Abuja and 11 miles from IBB Golf Club. "
  },
  {
    "name": "Tev",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Tev offers accommodations in Abuja, 9.3 miles from Magic Land Abuja and 13 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Fast Track Homes",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Offering a garden, Fast Track Homes offers accommodations in Abuja. The apartment features both Wifi and private parking free of charge. "
  },
  {
    "name": "APARTMENT 437 BY BELMONT",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "APARTMENT 437 BY BELMONT is offering accommodations in Abuja. 3.1 miles from Magic Land Abuja and 8.9 miles from IBB Golf Club, the property features a terrace and a bar. "
  },
  {
    "name": "Royale Suite Palace",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "7.7 miles from IBB Golf Club in Abuja, Royale Suite Palace features accommodations with access to a hot tub. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "Decovenant Apartments",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "Decovenant Apartments is located in Abuja, just 11 miles from Magic Land Abuja and 16 miles from IBB Golf Club. Both Wifi and private parking are available at the apartment free of charge. "
  },
  {
    "name": "Mindyourbusiness villa",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Featuring garden views, Mindyourbusiness villa in Abuja features accommodations and a garden. With free private parking, the property is 18 miles from IBB Golf Club and 20 miles from Magic Land Abuja...."
  },
  {
    "name": "Lukeville Suites",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Lukeville Suites offers accommodations in Abuja, 4.5 miles from IBB Golf Club and 7.3 miles from Magic Land Abuja. This guest house offers a bar. "
  },
  {
    "name": "Home Seven Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "7.7 miles from Magic Land Abuja in Abuja, Home Seven Apartments provides accommodations with access to a sauna. This property offers access to a terrace, free private parking, and free Wifi. "
  },
  {
    "name": "Abuja Apartments 24 (B&H)",
    "location": "Abuja",
    "ratings": 5.5,
    "starRating": null,
    "reviews": "31 reviews",
    "descriptions": "Abuja Apartments 24 (B&H) is located in Abuja, just 6.9 miles from Magic Land Abuja and 9.5 miles from IBB Golf Club. This homestay offers a garden. "
  },
  {
    "name": "Sillich Homes - 4 Bedroom Duplex in Lokogoma",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Sillich Homes - 4 Bedroom Duplex in Lokogoma is located in Abuja, just 9.1 miles from Magic Land Abuja and 12 miles from IBB Golf Club. "
  },
  {
    "name": "Amazing Studio Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Amazing Studio Apartment is located in Abuja, just 5 miles from Magic Land Abuja and 6.9 miles from IBB Golf Club. Both free Wifi and private parking are available at the apartment free of charge. "
  },
  {
    "name": "Glamour park hotel and apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": 3,
    "reviews": null,
    "descriptions": "Located in Abuja, 3 miles from Magic Land Abuja, Glamour park hotel and apartment provides accommodations with a restaurant, free private parking and a bar. "
  },
  {
    "name": "Apartment D1",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Apartment D1 is located in Abuja, just 12 miles from IBB Golf Club and 14 miles from Magic Land Abuja. Complimentary Wifi is featured throughout the property and private parking is available on site. "
  },
  {
    "name": "Stylish Studio Apartment",
    "location": "Abuja",
    "ratings": 8,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "With free private parking, the property is 3.1 miles from Magic Land Abuja and 11 miles from IBB Golf Club. The accommodation is non-smoking. "
  },
  {
    "name": "Cc & Cg Homes Luxury 4-Beds Apart Abuja-24Hrs",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "11 miles from Magic Land Abuja in Abuja, Cc & Cg Homes Luxury 4-Beds Apart Abuja-24Hrs provides accommodations with access to spa facilities, wellness packages, and beauty services. "
  },
  {
    "name": "Sejour International",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Sejour International is offering accommodations in Abuja. With free private parking, the property is 5.8 miles from Magic Land Abuja and 11 miles from IBB Golf Club. "
  },
  {
    "name": "Exexcutives Homes",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Exexcutives Homes in Abuja provides accommodations with a garden and a bar. This property offers access to a terrace, free private parking, and free Wifi. The rooms are equipped with a balcony. "
  },
  {
    "name": "KADAL IN LIFECAMP",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "KADAL IN LIFECAMP offers an outdoor swimming pool and accommodations with a kitchen in Abuja, 7.6 miles from Magic Land Abuja. The apartment is 12 miles from IBB Golf Club. "
  },
  {
    "name": "De-Omega Homes - Serviced Apartment Jahi, Abuja",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Providing a terrace, De-Omega Homes - Serviced Apartment Jahi, Abuja provides accommodations in Abuja. "
  },
  {
    "name": "Amber",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Amber is located in Abuja, just 3.9 miles from Magic Land Abuja and 7 miles from IBB Golf Club. This apartment provides free private parking, full-day security, and free Wifi. "
  },
  {
    "name": "Lakehouse Apartment - Lake Titicaca - One Bedroom Apartment",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "With free private parking, the property is 2.3 miles from Magic Land Abuja and 10 miles from IBB Golf Club. "
  },
  {
    "name": "Carolina Apartments Wuye",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Carolina Apartments Wuye enjoys a location in Abuja, a 15-minute walk from Magic Land Abuja and 10 miles from IBB Golf Club. "
  },
  {
    "name": "Chennad Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "With free private parking, the property is 2.9 miles from Magic Land Abuja and 8.7 miles from IBB Golf Club. A flat-screen TV is featured. The accommodation is non-smoking. "
  },
  {
    "name": "Luxury Villa within Abuja Sanctuary",
    "location": "Abuja",
    "ratings": 9,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "Luxury Villa within Abuja Sanctuary offers accommodations in Abuja, 4.3 miles from Magic Land Abuja and 7.3 miles from IBB Golf Club. "
  },
  {
    "name": "D'Leisures Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Providing a bar, D'Leisures Apartment features accommodations in Abuja. "
  },
  {
    "name": "Tugo Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Tugo Apartment offers accommodations in Abuja, 16 miles from IBB Golf Club and 18 miles from Magic Land Abuja. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "Cosmetro Homes Abuja",
    "location": "Abuja",
    "ratings": 7.9,
    "starRating": null,
    "reviews": "11 reviews",
    "descriptions": "Cosmetro Homes Abuja offers air-conditioned accommodations in Abuja. This condo hotel features free private parking and a shared kitchen. "
  },
  {
    "name": "Maitama heights",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Maitama heights is located in Abuja, just 4.6 miles from IBB Golf Club and 7.2 miles from Magic Land Abuja. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Lakehouse Apartment - Lake Baikal - One Bedroom Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Providing a garden, Lakehouse Apartment - Lake Baikal - One Bedroom Apartment provides accommodations in Abuja. "
  },
  {
    "name": "Sommy's place",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "With free private parking, the property is 4.2 miles from Magic Land Abuja and 4.9 miles from IBB Golf Club. "
  },
  {
    "name": "Madaki's Executive Suites",
    "location": "Abuja",
    "ratings": null,
    "starRating": 3,
    "reviews": null,
    "descriptions": "Located in Abuja, 4.1 miles from IBB Golf Club, Madaki's Executive Suites provides accommodations with a fitness center, free private parking, a garden and a shared lounge. "
  },
  {
    "name": "3 Bederoom Apartment in Gudu",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "3 Bederoom Apartment in Gudu offers accommodations in Abuja, 6.9 miles from Magic Land Abuja and 10 miles from IBB Golf Club. "
  },
  {
    "name": "LA VIVA AIRBNB",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "LA VIVA AIRBNB offers accommodations in Abuja, 6.7 miles from Magic Land Abuja. "
  },
  {
    "name": "The State Apartments",
    "location": "Abuja",
    "ratings": 8,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "The State Apartments enjoys a location in Abuja, 17 miles from IBB Golf Club and 18 miles from Magic Land Abuja. This property offers access to a terrace and free private parking. "
  },
  {
    "name": "Sparkles Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Sparkles Apartments offers accommodations in Abuja, 5.2 miles from Magic Land Abuja and 8.2 miles from IBB Golf Club. This apartment offers a garden. "
  },
  {
    "name": "Newton Park Hotels Annex",
    "location": "Abuja",
    "ratings": 7,
    "starRating": 3,
    "reviews": "1 review",
    "descriptions": "Located in Abuja, 4.1 miles from Magic Land Abuja, Newton Park Hotels Annex provides accommodations with a shared lounge, free private parking, a restaurant and a bar. "
  },
  {
    "name": "VINEWOOD SUITE+GYM, RHODABODE APT, NILE",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "VINEWOOD SUITE+GYM, RHODABODE APT, NILE is located in Abuja, just 7 miles from Magic Land Abuja and 11 miles from IBB Golf Club. This apartment offers a garden. "
  },
  {
    "name": "Estefania Homes",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "8.1 miles from IBB Golf Club in Abuja, Estefania Homes provides accommodations with access to a hot tub. The air-conditioned accommodation is 3.8 miles from Magic Land Abuja. "
  },
  {
    "name": "Luxury Oasis 1 - Entire 1 Bedroom Apartment in Abuja with Pool, Games, WiFi, Balcony, and Garden",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Luxury Oasis 1 - Entire 1 Bedroom Apartment in Abuja with Pool, Games, WiFi, Balcony, and Garden is located in Abuja, just 4.5 miles from Magic Land Abuja and 7.2 miles from IBB Golf Club. "
  },
  {
    "name": "Signature Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Signature Apartments in Abuja provides accommodations with a fitness center, a bar, and a shared lounge. Guests are welcome to go for a swim in the private pool. "
  },
  {
    "name": "Apartment 206, Jamieson’s court.",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Apartment 206, Jamieson’s court. Is located in Abuja, just 4.7 miles from Magic Land Abuja and 8 miles from IBB Golf Club. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "Address hotels and towers",
    "location": "Abuja",
    "ratings": null,
    "starRating": 4,
    "reviews": null,
    "descriptions": "Located within 3.8 miles of IBB Golf Club and 5.1 miles of Magic Land Abuja, Address hotels and towers has rooms in Abuja. "
  },
  {
    "name": "Santee Shortlet",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Santee Shortlet offers accommodations in Abuja, 5.5 miles from IBB Golf Club. "
  },
  {
    "name": "All States Apartment",
    "location": "Abuja",
    "ratings": 4.5,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "All States Apartment offers accommodations in Abuja, 16 miles from IBB Golf Club and 18 miles from Magic Land Abuja. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Smart 3 bed apartment with fast Wi-Fi & 24hr light",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Smart 3 bed apartment with fast Wi-Fi & 24hr light offers accommodations in Abuja, 7 miles from IBB Golf Club. With city views, this accommodation provides a balcony. "
  },
  {
    "name": "Modern City Center 3-Bed Apartment",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "Modern City Center 3-Bed Apartment is located in Abuja, just 5.4 miles from Magic Land Abuja and 5.7 miles from IBB Golf Club. The apartment features both Wifi and private parking free of charge. "
  },
  {
    "name": "ABUJA SALES HUB (ASH) APARTMENTS",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "ABUJA SALES HUB (ASH) APARTMENTS is located in Abuja, just 6.7 miles from Magic Land Abuja and 8 miles from IBB Golf Club. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "Akida Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Akida Apartments offers accommodations in Abuja, 3.9 miles from Magic Land Abuja and 6.8 miles from IBB Golf Club. The apartment offers rooms with air conditioning, free private parking, and free..."
  },
  {
    "name": "Roof top Studio+Gym+Snooker Rhodabode Apt, Nile",
    "location": "Abuja",
    "ratings": 8,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "7 miles from Magic Land Abuja in Abuja, Roof top Studio+Gym+Snooker Rhodabode Apt, Nile features accommodations with access to a fitness center. "
  },
  {
    "name": "an exquiste 3 bedroom apartment, in a peaceful environment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "An exquiste 3 bedroom apartment, in a peaceful environment is located in Abuja, just 5.8 miles from IBB Golf Club and 6.5 miles from Magic Land Abuja. "
  },
  {
    "name": "OGI Homes",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "OGI Homes offers accommodations in Abuja, 5 miles from Magic Land Abuja and 8 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "CALBERT LODGE",
    "location": "Abuja",
    "ratings": null,
    "starRating": 4,
    "reviews": null,
    "descriptions": "Located within 3.8 miles of Magic Land Abuja and 5.4 miles of IBB Golf Club, CALBERT LODGE has rooms in Abuja. "
  },
  {
    "name": "Prive Apartments Katampe Extension 3bed",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Prive Apartments Katampe Extension 3bed is located in Abuja, just 10 miles from IBB Golf Club and 11 miles from Magic Land Abuja. "
  },
  {
    "name": "Hotel De Aloommah",
    "location": "Abuja",
    "ratings": 1,
    "starRating": 3,
    "reviews": "1 review",
    "descriptions": "Located in Abuja, 17 miles from IBB Golf Club, Hotel De Aloommah has accommodations with a garden, free private parking, a restaurant and a bar. "
  },
  {
    "name": "NIFEWAT APARTMENT,Rennes suite 2bedroom apartment with gym,pool, WiFi,Netflix,bar and sitting out area",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Providing a garden, NIFEWAT APARTMENT, Rennes suite 2bedroom apartment with gym, pool, WiFi, Netflix,bar and sitting out area features accommodations in Abuja. "
  },
  {
    "name": "Sow luxury apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "The air-conditioned accommodation is 11 miles from IBB Golf Club. Free Wifi is available throughout the property and Magic Land Abuja is 5.8 miles away. "
  },
  {
    "name": "The Embassy Apartment",
    "location": "Abuja",
    "ratings": 9.3,
    "starRating": null,
    "reviews": "3 reviews",
    "descriptions": "The Embassy Apartment offers accommodations in Abuja, 2.9 miles from Magic Land Abuja and 7.2 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Luxury Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Luxury Apartment offers accommodations in Abuja, 10 miles from IBB Golf Club. "
  },
  {
    "name": "All States Apartments",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "All States Apartments is located in Abuja, just 17 miles from IBB Golf Club and 18 miles from Magic Land Abuja. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "FANZMA APARTMENTS",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "FANZMA APARTMENTS offers accommodations in Abuja, 8.2 miles from Magic Land Abuja. The air-conditioned accommodation is 5.8 miles from IBB Golf Club. "
  },
  {
    "name": "Micasa Shortlets",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Micasa Shortlets offers accommodations in Abuja, 10 miles from Magic Land Abuja and 13 miles from IBB Golf Club. The homestay provides rooms with air conditioning, free private parking, and free Wifi...."
  },
  {
    "name": "Cozy Residence Abuja",
    "location": "Abuja",
    "ratings": null,
    "starRating": 4,
    "reviews": null,
    "descriptions": "Located in Abuja, 5.2 miles from Magic Land Abuja, Cozy Residence Abuja provides accommodations with a shared lounge, free private parking, a restaurant and a bar. "
  },
  {
    "name": "CENTURION APARTMENTS WUSE 2",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "CENTURION APARTMENTS WUSE 2 offers accommodations in Abuja, 4 miles from Magic Land Abuja and 5.1 miles from IBB Golf Club. "
  },
  {
    "name": "Paulight Residence",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "7.8 miles from Magic Land Abuja in Abuja, Paulight Residence offers accommodations with access to a fitness room. This property offers access to a terrace and free private parking. "
  },
  {
    "name": "Luxury Oasis 2 - Entire 2 Bedroom Apartment in Abuja with Pool, Games, WiFi, Balcony, and Garden",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Luxury Oasis 2 - Entire 2 Bedroom Apartment in Abuja with Pool, Games, WiFi, Balcony, and Garden is located in Abuja, just 4.5 miles from Magic Land Abuja and 7.2 miles from IBB Golf Club. "
  },
  {
    "name": "Ennyln's Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Ennyln's Apartments offers accommodations in Abuja, 5.5 miles from Magic Land Abuja and 11 miles from IBB Golf Club. The apartment provides both free Wifi and free private parking. "
  },
  {
    "name": "Ayahscourt",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Providing a garden, Ayahscourt provides accommodations in Abuja. This property offers access to a terrace, free private parking, and free Wifi. "
  },
  {
    "name": "Folio Spaces and Experiences",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Folio Spaces and Experiences offers accommodations in Abuja, 4.3 miles from IBB Golf Club and 5.8 miles from Magic Land Abuja. This property offers access to a terrace and free private parking. "
  },
  {
    "name": "Harlem apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Harlem apartment offers accommodations in Abuja, 14 miles from IBB Golf Club. "
  },
  {
    "name": "Raybead L' Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Raybead L' Apartment offers accommodations in Abuja, 11 miles from IBB Golf Club. "
  },
  {
    "name": "De-Convenant Apartment",
    "location": "Abuja",
    "ratings": 1,
    "starRating": 3,
    "reviews": "1 review",
    "descriptions": "Located in Abuja, 13 miles from Magic Land Abuja, De-Convenant Apartment has accommodations with free WiFi and free private parking. Guests can enjoy city views. "
  },
  {
    "name": "Kay's ville Apartment",
    "location": "Abuja",
    "ratings": 7.3,
    "starRating": null,
    "reviews": "10 reviews",
    "descriptions": "Kay's ville Apartment offers accommodations in Abuja, 2.8 miles from Magic Land Abuja and 8.9 miles from IBB Golf Club. "
  },
  {
    "name": "Villa Vista",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Villa Vista offers accommodations in Abuja, 3.9 miles from Magic Land Abuja and 6.8 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Kitis luxury homes",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Kitis luxury homes offers accommodations in Abuja, 6.1 miles from IBB Golf Club. This apartment offers air-conditioned accommodations with a balcony. "
  },
  {
    "name": "Spacious & affordable 3 bedroom",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Spacious & affordable 3 bedroom is located in Abuja, just 11 miles from Magic Land Abuja and 15 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi...."
  },
  {
    "name": "Asfranz Apartment Luxury One-Bedroom with Private Garden",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Asfranz Apartment Luxury One-Bedroom with Private Garden offers accommodations in Abuja, 5.5 miles from Magic Land Abuja and 8.6 miles from IBB Golf Club. This apartment offers a garden. "
  },
  {
    "name": "BONPHINE LUXURY SUITES",
    "location": "Abuja",
    "ratings": null,
    "starRating": 3,
    "reviews": null,
    "descriptions": "Located in Abuja, 7 miles from Magic Land Abuja, BONPHINE LUXURY SUITES has accommodations with a restaurant, free private parking and a bar. "
  },
  {
    "name": "778 Stonehouse Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "778 Stonehouse Apartments offers accommodations in Abuja, 8.3 miles from Magic Land Abuja and 10 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free..."
  },
  {
    "name": "Western Dreams Hotel",
    "location": "Abuja",
    "ratings": 4.7,
    "starRating": null,
    "reviews": "33 reviews",
    "descriptions": "Offering an outdoor pool and a restaurant, Western Dreams Hotel is located in Jabi. Free Wi-Fi access is available. "
  },
  {
    "name": "Jazeera Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Jazeera Apartments offers accommodations in Abuja, 12 miles from IBB Golf Club and 14 miles from Magic Land Abuja. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Room in Lodge - Joy House Hotel And Suites",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Room in Lodge - Joy House Hotel And Suites is located in Abuja, just 3.6 miles from Magic Land Abuja and 5.1 miles from IBB Golf Club. "
  },
  {
    "name": "Jessa Joan Serviced Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Jessa Joan Serviced Apartments offers accommodations in Abuja, 7.2 miles from Magic Land Abuja and 12 miles from IBB Golf Club. "
  },
  {
    "name": "Hillworld Apartment wuye",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Hillworld Apartment wuye offers accommodations in Abuja, 3.3 miles from Magic Land Abuja and 8.2 miles from IBB Golf Club. This apartment provides air-conditioned accommodations with a terrace. "
  },
  {
    "name": "Well furnished and very spacious apartment in Wuye",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Well furnished and very spacious apartment in Wuye is located in Abuja, just 2 miles from Magic Land Abuja and 9 miles from IBB Golf Club. "
  },
  {
    "name": "Select Winsome 1 Room, 1 King-sized Bed",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Select Winsome 1 Room, 1 King-sized Bed offers accommodations in Abuja, 14 miles from IBB Golf Club. Free Wifi is available throughout the property and Magic Land Abuja is 10 miles away. "
  },
  {
    "name": "Elnora residents",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Elnora residents offers accommodations in Abuja, 5.2 miles from Magic Land Abuja and 10 miles from IBB Golf Club. With lake views, this accommodation provides a balcony. "
  },
  {
    "name": "Sovic Smart Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": 3,
    "reviews": null,
    "descriptions": "Located in Abuja, 12 miles from Magic Land Abuja, Sovic Smart Apartments provides accommodations with a garden, free private parking and a restaurant. "
  },
  {
    "name": "YANNA APARTMENT BY KHALIQUES",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "YANNA APARTMENT BY KHALIQUES offers spa facilities and wellness packages, as well as air-conditioned accommodations with free Wifi in Abuja, 4.5 miles from Magic Land Abuja. "
  },
  {
    "name": "Zenith Apartie",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Zenith Apartie offers accommodations in Abuja, 5.9 miles from Magic Land Abuja and 9.2 miles from IBB Golf Club. The apartment provides rooms with air conditioning, free private parking, and free..."
  },
  {
    "name": "The Francis Hotel",
    "location": "Abuja",
    "ratings": 5,
    "starRating": null,
    "reviews": "4 reviews",
    "descriptions": "Located in Abuja, 1.2 miles from Magic Land Abuja, The Francis Hotel provides accommodations with an outdoor swimming pool, free private parking, a fitness center and a restaurant. "
  },
  {
    "name": "Zenith haven",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Zenith haven offers accommodations in Abuja, 12 miles from IBB Golf Club. The air-conditioned accommodation is 8.6 miles from Magic Land Abuja. "
  },
  {
    "name": "Cc & Cg Homes Luxury 4 Bedrooms Apartment",
    "location": "Abuja",
    "ratings": 6.3,
    "starRating": null,
    "reviews": "3 reviews",
    "descriptions": "8.9 miles from Magic Land Abuja in Abuja, Cc & Cg Homes Luxury 4 Bedrooms Apartment offers accommodations with access to spa facilities, wellness packages, and beauty services. "
  },
  {
    "name": "Junivikhomes",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Junivikhomes is located in Abuja, just 11 miles from Magic Land Abuja and 16 miles from IBB Golf Club. This property offers access to a terrace, free private parking, and free Wifi. "
  },
  {
    "name": "NIFEWAT APARTMENT,2 bedroom apartment NICE SUITE with pool, gym,Netflix, WiFi and sitting out area",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Providing a bar, NIFEWAT APARTMENT,2 bedroom apartment NICE SUITE with pool, gym, Netflix, WiFi and sitting out area features accommodations in Abuja. "
  },
  {
    "name": "Sparkles Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Sparkles Apartments offers accommodations in Abuja, 5.1 miles from Magic Land Abuja and 8.1 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Jahi Loft",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Jahi Loft offers accommodations in Abuja, 8.7 miles from IBB Golf Club and 9 miles from Magic Land Abuja. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "Duke Diamonds Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Duke Diamonds Apartments offers accommodations in Abuja, 9.3 miles from IBB Golf Club. The air-conditioned accommodations are 2.3 miles from Magic Land Abuja. "
  },
  {
    "name": "Apricot Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Apricot Apartment offers accommodations in Abuja, 4.3 miles from Magic Land Abuja and 7.6 miles from IBB Golf Club. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "Abrax Apartments Maitama",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Abrax Apartments Maitama offers accommodations in Abuja, 3.6 miles from IBB Golf Club and 8.4 miles from Magic Land Abuja. This property offers access to a balcony, free private parking, and free..."
  },
  {
    "name": "Green Valley Palace",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Green Valley Palace offers accommodations in Abuja, 10 miles from Magic Land Abuja and 14 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Grace Court",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Grace Court offers accommodations in Abuja, 4.8 miles from Magic Land Abuja and 7.8 miles from IBB Golf Club. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "Dumeros",
    "location": "Abuja",
    "ratings": 5.3,
    "starRating": null,
    "reviews": "9 reviews",
    "descriptions": "Dumeros is located in Abuja, just 5 miles from Magic Land Abuja and 9.3 miles from IBB Golf Club. This property offers access to a terrace and free private parking. "
  },
  {
    "name": "Opal Ville Bamboo Suite, 2-bedroom in a serene area",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "With free private parking, the property is 6.9 miles from Magic Land Abuja and 13 miles from IBB Golf Club. "
  },
  {
    "name": "Icon Grand Apartments (The Rock View)",
    "location": "Abuja",
    "ratings": 7,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "With free private parking, the property is 14 miles from IBB Golf Club and 16 miles from Magic Land Abuja. "
  },
  {
    "name": "Blue-View Suites & Apartments",
    "location": "Abuja",
    "ratings": 2.2,
    "starRating": null,
    "reviews": "5 reviews",
    "descriptions": "Located in Abuja, 12 miles from Magic Land Abuja, Blue-View Suites & Apartments provides accommodations with a shared lounge, free private parking, a restaurant and a bar. "
  },
  {
    "name": "Abuja Two bedroom luxury short-let( The paradise court)",
    "location": "Abuja",
    "ratings": 1,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "9.3 miles from Magic Land Abuja in Abuja, Abuja Two bedroom luxury short-let( The paradise court) offers accommodations with access to a hot tub. Guests can benefit from a balcony and a picnic area. "
  },
  {
    "name": "Blaze by Treston Grand Apartment, Maitama",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Blaze by Treston Grand Apartment, Maitama enjoys a location in Abuja, 4.6 miles from IBB Golf Club and 7.1 miles from Magic Land Abuja. With city views, this accommodation provides a balcony. "
  },
  {
    "name": "Moz One Executive Guest Rooms - Tourggourt",
    "location": "Abuja",
    "ratings": null,
    "starRating": 3,
    "reviews": null,
    "descriptions": "Located in Abuja, 3.3 miles from Magic Land Abuja, Moz One Executive Guest Rooms - Tourggourt provides accommodations with a restaurant, free private parking and a bar. "
  },
  {
    "name": "GLAMOUR PARK HOTEL AND APARTMENT",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "GLAMOUR PARK HOTEL AND APARTMENT is located in Abuja, just 3.1 miles from Magic Land Abuja and 7.3 miles from IBB Golf Club. This apartment features air-conditioned accommodations with a balcony. "
  },
  {
    "name": "Room in Lodge - Hotel De Bently - Deluxe",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Room in Lodge - Hotel De Bently - Deluxe is located in Abuja, just 2.4 miles from Magic Land Abuja and 8.5 miles from IBB Golf Club. With lake views, this accommodation features a balcony. "
  },
  {
    "name": "Select Elegant 3 Rooms 3 sized king-bed @ Abuja FCT",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Select Elegant 3 Rooms 3 sized king-bed @ Abuja FCT offers accommodations in Abuja, 14 miles from Magic Land Abuja and 18 miles from IBB Golf Club. "
  },
  {
    "name": "Cc & Cg Homes Luxury 3 Bedrooms House - 24Hrs Power",
    "location": "Abuja",
    "ratings": 9,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "8.9 miles from Magic Land Abuja in Abuja, Cc & Cg Homes Luxury 3 Bedrooms House - 24Hrs Power features accommodations with access to spa facilities and beauty services. "
  },
  {
    "name": "E Class Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "E Class Apartments enjoys a location in Abuja, 3 miles from Magic Land Abuja and 6.5 miles from IBB Golf Club. This apartment features a bar. "
  },
  {
    "name": "Ib Kay Apartments",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "Ib Kay Apartments offers accommodations in Abuja, 13 miles from IBB Golf Club and 15 miles from Magic Land Abuja. Private parking is available on site at this recently renovated property. "
  },
  {
    "name": "RUDISH COTTAGE (COZY & PRIVATE)",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "RUDISH COTTAGE (COZY & PRIVATE) offers accommodations in Abuja, 3.5 miles from Magic Land Abuja and 5.2 miles from IBB Golf Club. "
  },
  {
    "name": "Cc & Cg Homes Luxury 4 Bedrooms Holiday Home",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Cc & Cg Homes Luxury 4 Bedrooms Holiday Home is located in Abuja, just 11 miles from Magic Land Abuja and 16 miles from IBB Golf Club. This property offers access to a terrace and free private..."
  },
  {
    "name": "Fleeq Apartments",
    "location": "Abuja",
    "ratings": 10,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "A recently renovated apartment, Fleeq Apartments offers accommodations in Abuja. This property offers access to a terrace, free private parking, and free Wifi. Guests can use a garden. "
  },
  {
    "name": "NIFEWAT APARTMENT,Cardiff suite 2bedroom apartment with gym ,Netflix and WiFi",
    "location": "Abuja",
    "ratings": 9,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "7.2 miles from Magic Land Abuja in Abuja, NIFEWAT APARTMENT, Cardiff suite 2bedroom apartment with gym, Netflix and WiFi provides accommodations with access to a fitness room. "
  },
  {
    "name": "Concept Luxury Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Offering an infinity pool, Concept Luxury Apartment offers accommodations in Abuja. This property offers access to a terrace and free private parking. "
  },
  {
    "name": "The Residences At Fomella",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "The Residences At Fomella offers accommodations in Abuja, 4 miles from IBB Golf Club and 4.6 miles from Magic Land Abuja. "
  },
  {
    "name": "Madaki Executives Suites",
    "location": "Abuja",
    "ratings": null,
    "starRating": 3,
    "reviews": null,
    "descriptions": "Located in Abuja, 4.1 miles from IBB Golf Club, Madaki Executives Suites has accommodations with a garden, free private parking, a terrace and a restaurant. "
  },
  {
    "name": "Room in Lodge - Adanma Hotel and Suites",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "12 miles from IBB Golf Club in Abuja, Room in Lodge - Adanma Hotel and Suites provides accommodations with access to beauty services. "
  },
  {
    "name": "Villa Nuee Hotel & Suites Utako, Abuja",
    "location": "Abuja",
    "ratings": null,
    "starRating": 3,
    "reviews": null,
    "descriptions": "Located in Abuja, 3.1 miles from Magic Land Abuja, Villa Nuee Hotel & Suites Utako, Abuja provides accommodations with a shared lounge, free private parking, a restaurant and a bar. "
  },
  {
    "name": "Cosystay Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Cosystay Apartment is located in Abuja, just 3.7 miles from IBB Golf Club and 4.4 miles from Magic Land Abuja. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "The Mayrock Hotel",
    "location": "Abuja",
    "ratings": null,
    "starRating": 4,
    "reviews": null,
    "descriptions": "Located in Abuja, 5.2 miles from IBB Golf Club, The Mayrock Hotel has accommodations with a restaurant, free private parking and a bar. "
  },
  {
    "name": "Cozy 2 Beds Apart-24Hrs Elect/WIFI/Security",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Cozy 2 Beds Apart-24Hrs Elect/WIFI/Security offers accommodations in Abuja, 11 miles from Magic Land Abuja and 16 miles from IBB Golf Club. "
  },
  {
    "name": "Luxury Apartment Available for Shortlet at Jabi - Abuja",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Luxury Apartment Available for Shortlet at Jabi - Abuja is located in Abuja, just 4 miles from Magic Land Abuja and 10 miles from IBB Golf Club. "
  },
  {
    "name": "Plot 817 Apartments Mabushi",
    "location": "Abuja",
    "ratings": 7.4,
    "starRating": null,
    "reviews": "10 reviews",
    "descriptions": "Plot 817 Apartments Mabushi offers accommodations in Abuja, 4.2 miles from Magic Land Abuja and 8 miles from IBB Golf Club. Private parking is available on site at this recently renovated property. "
  },
  {
    "name": "DMK Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "DMK Apartments is located in Abuja, just 4.7 miles from IBB Golf Club and 6.8 miles from Magic Land Abuja. This property offers access to a terrace, free private parking, and free Wifi. "
  },
  {
    "name": "The Hague",
    "location": "Abuja",
    "ratings": null,
    "starRating": 1,
    "reviews": null,
    "descriptions": "Located in Abuja, 3.6 miles from IBB Golf Club, The Hague has accommodations with a garden, free private parking, a restaurant and a bar. "
  },
  {
    "name": "Andrax Place - 3 Bed Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Andrax Place - 3 Bed Apartment offers accommodations in Abuja, 14 miles from IBB Golf Club and 15 miles from Magic Land Abuja. This property offers access to a patio and free private parking. "
  },
  {
    "name": "Select Delightful 1 Room 1 king-sized Bed",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Select Delightful 1 Room 1 king-sized Bed is located in Abuja, just 10 miles from Magic Land Abuja and 14 miles from IBB Golf Club. "
  },
  {
    "name": "CIS Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "CIS Apartments offers accommodations in Abuja, 12 miles from Magic Land Abuja and 16 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "HOUSE 27 HABITAT ABUJA",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "HOUSE 27 HABITAT ABUJA offers accommodations in Abuja, 2.2 miles from Magic Land Abuja and 5.4 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Marathona Service Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Marathona Service Apartments offers accommodations in Abuja, 11 miles from IBB Golf Club. "
  },
  {
    "name": "Captain's Residence",
    "location": "Abuja",
    "ratings": 8,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "Providing a garden, Captain's Residence offers accommodations in Abuja. Private parking is available on site at this recently renovated property. "
  },
  {
    "name": "DMK Shared Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "DMK Shared Apartments is located in Abuja, just 4.7 miles from IBB Golf Club and 6.8 miles from Magic Land Abuja. This property offers access to a terrace, free private parking, and free Wifi. "
  },
  {
    "name": "House A142",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "House A142 features accommodations in Abuja. With free private parking, the property is 7.3 miles from Magic Land Abuja and 12 miles from IBB Golf Club. "
  },
  {
    "name": "Plistbooking Xive 3 bedroom Luxury Abuja Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "15 miles from IBB Golf Club in Abuja, Plistbooking Xive 3 bedroom Luxury Abuja Apartment features accommodations with access to a hot tub. "
  },
  {
    "name": "Room in Lodge - Cubana Suites-first class highly luxurious international standard hotel in Abuja",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Room in Lodge - Cubana Suites-first class highly luxurious international standard hotel in Abuja offers accommodations in Abuja, 4.5 miles from IBB Golf Club and 6.8 miles from Magic Land Abuja. "
  },
  {
    "name": "The Golden Palace",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Offering a garden, The Golden Palace provides accommodations in Abuja. "
  },
  {
    "name": "Davista Homes",
    "location": "Abuja",
    "ratings": 7,
    "starRating": null,
    "reviews": "1 review",
    "descriptions": "Davista Homes offers accommodations in Abuja, 7.3 miles from Magic Land Abuja and 12 miles from IBB Golf Club. This apartment provides free private parking, a 24-hour front desk, and free Wifi. "
  },
  {
    "name": "Belanova Apartments and Suites",
    "location": "Abuja",
    "ratings": 9,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "Belanova Apartments and Suites is located in the prime Maitama District of Abuja, 2.2 mi from Eagle Square and 4 minutes walk away from the Chinese Embassy. "
  },
  {
    "name": "Room in Lodge - Agura Hotel Garki Abuja",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Room in Lodge - Agura Hotel Garki Abuja offers accommodations in Abuja, 3.4 miles from Magic Land Abuja and 5.7 miles from IBB Golf Club. "
  },
  {
    "name": "Room in Lodge - Ambience Hotels Abujahome for leisure and business travellers",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Room in Lodge - Ambience Hotels Abujahome for leisure and business travellers offers accommodations in Abuja, 5.8 miles from IBB Golf Club and 6.6 miles from Magic Land Abuja. "
  },
  {
    "name": "Luxury 4-Beds Apart Abuja-24Hrs/Elect/WIFI/Securi",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Providing a garden, Luxury 4-Beds Apart Abuja-24Hrs/Elect/WIFI/Securi offers accommodations in Abuja. This property offers access to a terrace and free private parking. "
  },
  {
    "name": "The Blcksite: A 3 bedroom apartment in Wuse",
    "location": "Abuja",
    "ratings": 8,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "A recently renovated apartment, The Blcksite: A 3 bedroom apartment in Wuse offers accommodations in Abuja. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Arsenal's Lodge",
    "location": "Abuja",
    "ratings": 4.7,
    "starRating": null,
    "reviews": "3 reviews",
    "descriptions": "Arsenal's Lodge features accommodations in Abuja. With free private parking, the property is 7.5 miles from Magic Land Abuja and 12 miles from IBB Golf Club. "
  },
  {
    "name": "Zion Residence 5-Star 4-Bedroom Terrace House",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Zion Residence 5-Star 4-Bedroom Terrace House is located in Abuja, just 3.8 miles from Magic Land Abuja and 6.9 miles from IBB Golf Club. "
  },
  {
    "name": "Room in Apartment - Ayalla Hotels Suites-abuja Royal Suite",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Room in Apartment - Ayalla Hotels Suites-abuja Royal Suite offers accommodations in Abuja, 4.9 miles from IBB Golf Club and 5.3 miles from Magic Land Abuja. "
  },
  {
    "name": "1164 Residence Apartment",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "1164 Residence Apartment offers accommodations in Abuja, 3.3 miles from Magic Land Abuja and 7.6 miles from IBB Golf Club. "
  },
  {
    "name": "Elegant Maitama Retreat",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Elegant Maitama Retreat offers accommodations in Abuja, 4.6 miles from IBB Golf Club and 5.2 miles from Magic Land Abuja. This property offers access to a balcony, free private parking, and free Wifi...."
  },
  {
    "name": "Room in Lodge - The Chelsea Hotel Abuja",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Room in Lodge - The Chelsea Hotel Abuja is located in Abuja, just 3.2 miles from Magic Land Abuja and 4.9 miles from IBB Golf Club. "
  },
  {
    "name": "Apartment550",
    "location": "Abuja",
    "ratings": null,
    "starRating": 3,
    "reviews": null,
    "descriptions": "Located in Abuja, 4.4 miles from Magic Land Abuja, Apartment550 has accommodations with an outdoor swimming pool, free private parking, a garden and a restaurant. "
  },
  {
    "name": "Carlton Apex Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Carlton Apex Apartments offers accommodations in Abuja, 4.8 miles from Magic Land Abuja and 9.2 miles from IBB Golf Club. This property offers access to a balcony, free private parking, and free Wifi...."
  },
  {
    "name": "NNPC House 43",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "NNPC House 43 enjoys a location in Abuja, 7.6 miles from IBB Golf Club and 8 miles from Magic Land Abuja. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "House 43",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Providing a garden, House 43 provides accommodations in Abuja. This property offers access to a terrace and free private parking. "
  },
  {
    "name": "Alim Royal Hotel and Suite",
    "location": "Abuja",
    "ratings": null,
    "starRating": 4,
    "reviews": null,
    "descriptions": "Located 21 miles from IBB Golf Club, Alim Royal Hotel and Suite offers 4-star accommodations in Abuja and has a garden, a terrace and a bar. "
  },
  {
    "name": "Havre Luxury Apartment",
    "location": "Abuja",
    "ratings": 7.5,
    "starRating": null,
    "reviews": "2 reviews",
    "descriptions": "Havre Luxury Apartment is located in Abuja, just 14 miles from Magic Land Abuja and 18 miles from IBB Golf Club. This property offers a private pool, free Wifi, and free private parking. "
  },
  {
    "name": "Room in Lodge - The Envoy Hotel and Suites",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Room in Lodge - The Envoy Hotel and Suites is located in Abuja, just 2.7 miles from Magic Land Abuja and 5.3 miles from IBB Golf Club. "
  },
  {
    "name": "Poder Homes",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Poder Homes is located in Abuja, just a 8-minute walk from IBB Golf Club and 5.6 miles from Magic Land Abuja. This property offers access to a balcony, free private parking, and free Wifi. "
  },
  {
    "name": "Relais Guest House",
    "location": "Abuja",
    "ratings": null,
    "starRating": 4,
    "reviews": null,
    "descriptions": "Featuring 4-star accommodations, Relais Guest House is located in Abuja, 4.3 miles from IBB Golf Club and 5.8 miles from Magic Land Abuja. "
  },
  {
    "name": "Room in Lodge - Bristlecone Suites and Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Room in Lodge - Bristlecone Suites and Apartments offers accommodations in Abuja, 4.4 miles from IBB Golf Club and 8.4 miles from Magic Land Abuja. "
  },
  {
    "name": "Room in Lodge - Ayalla Hotels and Suites",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Room in Lodge - Ayalla Hotels and Suites offers accommodations in Abuja, 4.9 miles from IBB Golf Club and 5.3 miles from Magic Land Abuja. "
  },
  {
    "name": "Miraph APt. with Starlink wifi",
    "location": "Abuja",
    "ratings": 6,
    "starRating": null,
    "reviews": "3 reviews",
    "descriptions": "Miraph APt. With Starlink wifi is located in Abuja, just 6 miles from Magic Land Abuja and 12 miles from IBB Golf Club. This property offers access to a balcony and free private parking. "
  },
  {
    "name": "Madaki's Executive Suites",
    "location": "Abuja",
    "ratings": null,
    "starRating": 3,
    "reviews": null,
    "descriptions": "Located in Abuja, 4.1 miles from IBB Golf Club, Madaki's Executive Suites has accommodations with a garden, free private parking, a restaurant and a bar. "
  },
  {
    "name": "Mo-house Hotel and event center",
    "location": "Abuja",
    "ratings": null,
    "starRating": 3,
    "reviews": null,
    "descriptions": "Located in Abuja, 17 miles from IBB Golf Club, Mo-house Hotel and event center has accommodations with a terrace, free private parking, a restaurant and a bar. "
  },
  {
    "name": "Room in Lodge - Msp Residence and Apartments",
    "location": "Abuja",
    "ratings": null,
    "starRating": null,
    "reviews": null,
    "descriptions": "Room in Lodge - Msp Residence and Apartments is located in Abuja, just 3.8 miles from Magic Land Abuja and 4.7 miles from IBB Golf Club. "
  }
]